ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_scb.h
/* =======================================================  SCB.CTRL  ======================================================== */
#define SCB_CTRL_OVS_Pos                  (0UL)                 /*!< SCB CTRL: OVS (Bit 0)                                     */
#define SCB_CTRL_OVS_Msk                  (0xfUL)               /*!< SCB CTRL: OVS (Bitfield-Mask: 0x0f)                       */
#define SCB_CTRL_EC_AM_MODE_Pos           (8UL)                 /*!< SCB CTRL: EC_AM_MODE (Bit 8)                              */
#define SCB_CTRL_EC_AM_MODE_Msk           (0x100UL)             /*!< SCB CTRL: EC_AM_MODE (Bitfield-Mask: 0x01)                */
#define SCB_CTRL_EC_OP_MODE_Pos           (9UL)                 /*!< SCB CTRL: EC_OP_MODE (Bit 9)                              */
#define SCB_CTRL_EC_OP_MODE_Msk           (0x200UL)             /*!< SCB CTRL: EC_OP_MODE (Bitfield-Mask: 0x01)                */
#define SCB_CTRL_EZ_MODE_Pos              (10UL)                /*!< SCB CTRL: EZ_MODE (Bit 10)                                */
#define SCB_CTRL_EZ_MODE_Msk              (0x400UL)             /*!< SCB CTRL: EZ_MODE (Bitfield-Mask: 0x01)                   */
#define SCB_CTRL_BYTE_MODE_Pos            (11UL)                /*!< SCB CTRL: BYTE_MODE (Bit 11)                              */
#define SCB_CTRL_BYTE_MODE_Msk            (0x800UL)             /*!< SCB CTRL: BYTE_MODE (Bitfield-Mask: 0x01)                 */
#define SCB_CTRL_CMD_RESP_MODE_Pos        (12UL)                /*!< SCB CTRL: CMD_RESP_MODE (Bit 12)                          */
#define SCB_CTRL_CMD_RESP_MODE_Msk        (0x1000UL)            /*!< SCB CTRL: CMD_RESP_MODE (Bitfield-Mask: 0x01)             */
#define SCB_CTRL_ADDR_ACCEPT_Pos          (16UL)                /*!< SCB CTRL: ADDR_ACCEPT (Bit 16)                            */
#define SCB_CTRL_ADDR_ACCEPT_Msk          (0x10000UL)           /*!< SCB CTRL: ADDR_ACCEPT (Bitfield-Mask: 0x01)               */
#define SCB_CTRL_BLOCK_Pos                (17UL)                /*!< SCB CTRL: BLOCK (Bit 17)                                  */
#define SCB_CTRL_BLOCK_Msk                (0x20000UL)           /*!< SCB CTRL: BLOCK (Bitfield-Mask: 0x01)                     */
#define SCB_CTRL_MODE_Pos                 (24UL)                /*!< SCB CTRL: MODE (Bit 24)                                   */
#define SCB_CTRL_MODE_Msk                 (0x3000000UL)         /*!< SCB CTRL: MODE (Bitfield-Mask: 0x03)                      */
#define SCB_CTRL_ENABLED_Pos              (31UL)                /*!< SCB CTRL: ENABLED (Bit 31)                                */
#define SCB_CTRL_ENABLED_Msk              (0x80000000UL)        /*!< SCB CTRL: ENABLED (Bitfield-Mask: 0x01)                   */
/* ======================================================  SCB.STATUS  ======================================================= */
#define SCB_STATUS_EC_BUSY_Pos            (0UL)                 /*!< SCB STATUS: EC_BUSY (Bit 0)                               */
#define SCB_STATUS_EC_BUSY_Msk            (0x1UL)               /*!< SCB STATUS: EC_BUSY (Bitfield-Mask: 0x01)                 */
/* ===================================================  SCB.CMD_RESP_CTRL  =================================================== */
#define SCB_CMD_RESP_CTRL_BASE_RD_ADDR_Pos (0UL)                /*!< SCB CMD_RESP_CTRL: BASE_RD_ADDR (Bit 0)                   */
#define SCB_CMD_RESP_CTRL_BASE_RD_ADDR_Msk (0x1ffUL)            /*!< SCB CMD_RESP_CTRL: BASE_RD_ADDR (Bitfield-Mask: 0x1ff)    */
#define SCB_CMD_RESP_CTRL_BASE_WR_ADDR_Pos (16UL)               /*!< SCB CMD_RESP_CTRL: BASE_WR_ADDR (Bit 16)                  */
#define SCB_CMD_RESP_CTRL_BASE_WR_ADDR_Msk (0x1ff0000UL)        /*!< SCB CMD_RESP_CTRL: BASE_WR_ADDR (Bitfield-Mask: 0x1ff)    */
/* ==================================================  SCB.CMD_RESP_STATUS  ================================================== */
#define SCB_CMD_RESP_STATUS_CURR_RD_ADDR_Pos (0UL)              /*!< SCB CMD_RESP_STATUS: CURR_RD_ADDR (Bit 0)                 */
#define SCB_CMD_RESP_STATUS_CURR_RD_ADDR_Msk (0x1ffUL)          /*!< SCB CMD_RESP_STATUS: CURR_RD_ADDR (Bitfield-Mask: 0x1ff)  */
#define SCB_CMD_RESP_STATUS_CURR_WR_ADDR_Pos (16UL)             /*!< SCB CMD_RESP_STATUS: CURR_WR_ADDR (Bit 16)                */
#define SCB_CMD_RESP_STATUS_CURR_WR_ADDR_Msk (0x1ff0000UL)      /*!< SCB CMD_RESP_STATUS: CURR_WR_ADDR (Bitfield-Mask: 0x1ff)  */
#define SCB_CMD_RESP_STATUS_CMD_RESP_EC_BUS_BUSY_Pos (30UL)     /*!< SCB CMD_RESP_STATUS: CMD_RESP_EC_BUS_BUSY (Bit 30)        */
#define SCB_CMD_RESP_STATUS_CMD_RESP_EC_BUS_BUSY_Msk (0x40000000UL) /*!< SCB CMD_RESP_STATUS: CMD_RESP_EC_BUS_BUSY (Bitfield-Mask: 0x01)*/
#define SCB_CMD_RESP_STATUS_CMD_RESP_EC_BUSY_Pos (31UL)         /*!< SCB CMD_RESP_STATUS: CMD_RESP_EC_BUSY (Bit 31)            */
#define SCB_CMD_RESP_STATUS_CMD_RESP_EC_BUSY_Msk (0x80000000UL) /*!< SCB CMD_RESP_STATUS: CMD_RESP_EC_BUSY (Bitfield-Mask: 0x01)*/
/* =====================================================  SCB.SPI_CTRL  ====================================================== */
#define SCB_SPI_CTRL_SSEL_CONTINUOUS_Pos  (0UL)                 /*!< SCB SPI_CTRL: SSEL_CONTINUOUS (Bit 0)                     */
#define SCB_SPI_CTRL_SSEL_CONTINUOUS_Msk  (0x1UL)               /*!< SCB SPI_CTRL: SSEL_CONTINUOUS (Bitfield-Mask: 0x01)       */
#define SCB_SPI_CTRL_SELECT_PRECEDE_Pos   (1UL)                 /*!< SCB SPI_CTRL: SELECT_PRECEDE (Bit 1)                      */
#define SCB_SPI_CTRL_SELECT_PRECEDE_Msk   (0x2UL)               /*!< SCB SPI_CTRL: SELECT_PRECEDE (Bitfield-Mask: 0x01)        */
#define SCB_SPI_CTRL_CPHA_Pos             (2UL)                 /*!< SCB SPI_CTRL: CPHA (Bit 2)                                */
#define SCB_SPI_CTRL_CPHA_Msk             (0x4UL)               /*!< SCB SPI_CTRL: CPHA (Bitfield-Mask: 0x01)                  */
#define SCB_SPI_CTRL_CPOL_Pos             (3UL)                 /*!< SCB SPI_CTRL: CPOL (Bit 3)                                */
#define SCB_SPI_CTRL_CPOL_Msk             (0x8UL)               /*!< SCB SPI_CTRL: CPOL (Bitfield-Mask: 0x01)                  */
#define SCB_SPI_CTRL_LATE_MISO_SAMPLE_Pos (4UL)                 /*!< SCB SPI_CTRL: LATE_MISO_SAMPLE (Bit 4)                    */
#define SCB_SPI_CTRL_LATE_MISO_SAMPLE_Msk (0x10UL)              /*!< SCB SPI_CTRL: LATE_MISO_SAMPLE (Bitfield-Mask: 0x01)      */
#define SCB_SPI_CTRL_SCLK_CONTINUOUS_Pos  (5UL)                 /*!< SCB SPI_CTRL: SCLK_CONTINUOUS (Bit 5)                     */
#define SCB_SPI_CTRL_SCLK_CONTINUOUS_Msk  (0x20UL)              /*!< SCB SPI_CTRL: SCLK_CONTINUOUS (Bitfield-Mask: 0x01)       */
#define SCB_SPI_CTRL_SSEL_POLARITY0_Pos   (8UL)                 /*!< SCB SPI_CTRL: SSEL_POLARITY0 (Bit 8)                      */
#define SCB_SPI_CTRL_SSEL_POLARITY0_Msk   (0x100UL)             /*!< SCB SPI_CTRL: SSEL_POLARITY0 (Bitfield-Mask: 0x01)        */
#define SCB_SPI_CTRL_SSEL_POLARITY1_Pos   (9UL)                 /*!< SCB SPI_CTRL: SSEL_POLARITY1 (Bit 9)                      */
#define SCB_SPI_CTRL_SSEL_POLARITY1_Msk   (0x200UL)             /*!< SCB SPI_CTRL: SSEL_POLARITY1 (Bitfield-Mask: 0x01)        */
#define SCB_SPI_CTRL_SSEL_POLARITY2_Pos   (10UL)                /*!< SCB SPI_CTRL: SSEL_POLARITY2 (Bit 10)                     */
#define SCB_SPI_CTRL_SSEL_POLARITY2_Msk   (0x400UL)             /*!< SCB SPI_CTRL: SSEL_POLARITY2 (Bitfield-Mask: 0x01)        */
#define SCB_SPI_CTRL_SSEL_POLARITY3_Pos   (11UL)                /*!< SCB SPI_CTRL: SSEL_POLARITY3 (Bit 11)                     */
#define SCB_SPI_CTRL_SSEL_POLARITY3_Msk   (0x800UL)             /*!< SCB SPI_CTRL: SSEL_POLARITY3 (Bitfield-Mask: 0x01)        */
#define SCB_SPI_CTRL_LOOPBACK_Pos         (16UL)                /*!< SCB SPI_CTRL: LOOPBACK (Bit 16)                           */
#define SCB_SPI_CTRL_LOOPBACK_Msk         (0x10000UL)           /*!< SCB SPI_CTRL: LOOPBACK (Bitfield-Mask: 0x01)              */
#define SCB_SPI_CTRL_MODE_Pos             (24UL)                /*!< SCB SPI_CTRL: MODE (Bit 24)                               */
#define SCB_SPI_CTRL_MODE_Msk             (0x3000000UL)         /*!< SCB SPI_CTRL: MODE (Bitfield-Mask: 0x03)                  */
#define SCB_SPI_CTRL_SSEL_Pos             (26UL)                /*!< SCB SPI_CTRL: SSEL (Bit 26)                               */
#define SCB_SPI_CTRL_SSEL_Msk             (0xc000000UL)         /*!< SCB SPI_CTRL: SSEL (Bitfield-Mask: 0x03)                  */
#define SCB_SPI_CTRL_MASTER_MODE_Pos      (31UL)                /*!< SCB SPI_CTRL: MASTER_MODE (Bit 31)                        */
#define SCB_SPI_CTRL_MASTER_MODE_Msk      (0x80000000UL)        /*!< SCB SPI_CTRL: MASTER_MODE (Bitfield-Mask: 0x01)           */
/* ====================================================  SCB.SPI_STATUS  ===================================================== */
#define SCB_SPI_STATUS_BUS_BUSY_Pos       (0UL)                 /*!< SCB SPI_STATUS: BUS_BUSY (Bit 0)                          */
#define SCB_SPI_STATUS_BUS_BUSY_Msk       (0x1UL)               /*!< SCB SPI_STATUS: BUS_BUSY (Bitfield-Mask: 0x01)            */
#define SCB_SPI_STATUS_SPI_EC_BUSY_Pos    (1UL)                 /*!< SCB SPI_STATUS: SPI_EC_BUSY (Bit 1)                       */
#define SCB_SPI_STATUS_SPI_EC_BUSY_Msk    (0x2UL)               /*!< SCB SPI_STATUS: SPI_EC_BUSY (Bitfield-Mask: 0x01)         */
#define SCB_SPI_STATUS_CURR_EZ_ADDR_Pos   (8UL)                 /*!< SCB SPI_STATUS: CURR_EZ_ADDR (Bit 8)                      */
#define SCB_SPI_STATUS_CURR_EZ_ADDR_Msk   (0xff00UL)            /*!< SCB SPI_STATUS: CURR_EZ_ADDR (Bitfield-Mask: 0xff)        */
#define SCB_SPI_STATUS_BASE_EZ_ADDR_Pos   (16UL)                /*!< SCB SPI_STATUS: BASE_EZ_ADDR (Bit 16)                     */
#define SCB_SPI_STATUS_BASE_EZ_ADDR_Msk   (0xff0000UL)          /*!< SCB SPI_STATUS: BASE_EZ_ADDR (Bitfield-Mask: 0xff)        */
/* =====================================================  SCB.UART_CTRL  ===================================================== */
#define SCB_UART_CTRL_LOOPBACK_Pos        (16UL)                /*!< SCB UART_CTRL: LOOPBACK (Bit 16)                          */
#define SCB_UART_CTRL_LOOPBACK_Msk        (0x10000UL)           /*!< SCB UART_CTRL: LOOPBACK (Bitfield-Mask: 0x01)             */
#define SCB_UART_CTRL_MODE_Pos            (24UL)                /*!< SCB UART_CTRL: MODE (Bit 24)                              */
#define SCB_UART_CTRL_MODE_Msk            (0x3000000UL)         /*!< SCB UART_CTRL: MODE (Bitfield-Mask: 0x03)                 */
/* ===================================================  SCB.UART_TX_CTRL  ==================================================== */
#define SCB_UART_TX_CTRL_STOP_BITS_Pos    (0UL)                 /*!< SCB UART_TX_CTRL: STOP_BITS (Bit 0)                       */
#define SCB_UART_TX_CTRL_STOP_BITS_Msk    (0x7UL)               /*!< SCB UART_TX_CTRL: STOP_BITS (Bitfield-Mask: 0x07)         */
#define SCB_UART_TX_CTRL_PARITY_Pos       (4UL)                 /*!< SCB UART_TX_CTRL: PARITY (Bit 4)                          */
#define SCB_UART_TX_CTRL_PARITY_Msk       (0x10UL)              /*!< SCB UART_TX_CTRL: PARITY (Bitfield-Mask: 0x01)            */
#define SCB_UART_TX_CTRL_PARITY_ENABLED_Pos (5UL)               /*!< SCB UART_TX_CTRL: PARITY_ENABLED (Bit 5)                  */
#define SCB_UART_TX_CTRL_PARITY_ENABLED_Msk (0x20UL)            /*!< SCB UART_TX_CTRL: PARITY_ENABLED (Bitfield-Mask: 0x01)    */
#define SCB_UART_TX_CTRL_RETRY_ON_NACK_Pos (8UL)                /*!< SCB UART_TX_CTRL: RETRY_ON_NACK (Bit 8)                   */
#define SCB_UART_TX_CTRL_RETRY_ON_NACK_Msk (0x100UL)            /*!< SCB UART_TX_CTRL: RETRY_ON_NACK (Bitfield-Mask: 0x01)     */
/* ===================================================  SCB.UART_RX_CTRL  ==================================================== */
#define SCB_UART_RX_CTRL_STOP_BITS_Pos    (0UL)                 /*!< SCB UART_RX_CTRL: STOP_BITS (Bit 0)                       */
#define SCB_UART_RX_CTRL_STOP_BITS_Msk    (0x7UL)               /*!< SCB UART_RX_CTRL: STOP_BITS (Bitfield-Mask: 0x07)         */
#define SCB_UART_RX_CTRL_PARITY_Pos       (4UL)                 /*!< SCB UART_RX_CTRL: PARITY (Bit 4)                          */
#define SCB_UART_RX_CTRL_PARITY_Msk       (0x10UL)              /*!< SCB UART_RX_CTRL: PARITY (Bitfield-Mask: 0x01)            */
#define SCB_UART_RX_CTRL_PARITY_ENABLED_Pos (5UL)               /*!< SCB UART_RX_CTRL: PARITY_ENABLED (Bit 5)                  */
#define SCB_UART_RX_CTRL_PARITY_ENABLED_Msk (0x20UL)            /*!< SCB UART_RX_CTRL: PARITY_ENABLED (Bitfield-Mask: 0x01)    */
#define SCB_UART_RX_CTRL_POLARITY_Pos     (6UL)                 /*!< SCB UART_RX_CTRL: POLARITY (Bit 6)                        */
#define SCB_UART_RX_CTRL_POLARITY_Msk     (0x40UL)              /*!< SCB UART_RX_CTRL: POLARITY (Bitfield-Mask: 0x01)          */
#define SCB_UART_RX_CTRL_DROP_ON_PARITY_ERROR_Pos (8UL)         /*!< SCB UART_RX_CTRL: DROP_ON_PARITY_ERROR (Bit 8)            */
#define SCB_UART_RX_CTRL_DROP_ON_PARITY_ERROR_Msk (0x100UL)     /*!< SCB UART_RX_CTRL: DROP_ON_PARITY_ERROR (Bitfield-Mask: 0x01)*/
#define SCB_UART_RX_CTRL_DROP_ON_FRAME_ERROR_Pos (9UL)          /*!< SCB UART_RX_CTRL: DROP_ON_FRAME_ERROR (Bit 9)             */
#define SCB_UART_RX_CTRL_DROP_ON_FRAME_ERROR_Msk (0x200UL)      /*!< SCB UART_RX_CTRL: DROP_ON_FRAME_ERROR (Bitfield-Mask: 0x01)*/
#define SCB_UART_RX_CTRL_MP_MODE_Pos      (10UL)                /*!< SCB UART_RX_CTRL: MP_MODE (Bit 10)                        */
#define SCB_UART_RX_CTRL_MP_MODE_Msk      (0x400UL)             /*!< SCB UART_RX_CTRL: MP_MODE (Bitfield-Mask: 0x01)           */
#define SCB_UART_RX_CTRL_LIN_MODE_Pos     (12UL)                /*!< SCB UART_RX_CTRL: LIN_MODE (Bit 12)                       */
#define SCB_UART_RX_CTRL_LIN_MODE_Msk     (0x1000UL)            /*!< SCB UART_RX_CTRL: LIN_MODE (Bitfield-Mask: 0x01)          */
#define SCB_UART_RX_CTRL_SKIP_START_Pos   (13UL)                /*!< SCB UART_RX_CTRL: SKIP_START (Bit 13)                     */
#define SCB_UART_RX_CTRL_SKIP_START_Msk   (0x2000UL)            /*!< SCB UART_RX_CTRL: SKIP_START (Bitfield-Mask: 0x01)        */
#define SCB_UART_RX_CTRL_BREAK_WIDTH_Pos  (16UL)                /*!< SCB UART_RX_CTRL: BREAK_WIDTH (Bit 16)                    */
#define SCB_UART_RX_CTRL_BREAK_WIDTH_Msk  (0xf0000UL)           /*!< SCB UART_RX_CTRL: BREAK_WIDTH (Bitfield-Mask: 0x0f)       */
/* ==================================================  SCB.UART_RX_STATUS  =================================================== */
#define SCB_UART_RX_STATUS_BR_COUNTER_Pos (0UL)                 /*!< SCB UART_RX_STATUS: BR_COUNTER (Bit 0)                    */
#define SCB_UART_RX_STATUS_BR_COUNTER_Msk (0xfffUL)             /*!< SCB UART_RX_STATUS: BR_COUNTER (Bitfield-Mask: 0xfff)     */
/* ==================================================  SCB.UART_FLOW_CTRL  =================================================== */
#define SCB_UART_FLOW_CTRL_TRIGGER_LEVEL_Pos (0UL)              /*!< SCB UART_FLOW_CTRL: TRIGGER_LEVEL (Bit 0)                 */
#define SCB_UART_FLOW_CTRL_TRIGGER_LEVEL_Msk (0xffUL)           /*!< SCB UART_FLOW_CTRL: TRIGGER_LEVEL (Bitfield-Mask: 0xff)   */
#define SCB_UART_FLOW_CTRL_RTS_POLARITY_Pos (16UL)              /*!< SCB UART_FLOW_CTRL: RTS_POLARITY (Bit 16)                 */
#define SCB_UART_FLOW_CTRL_RTS_POLARITY_Msk (0x10000UL)         /*!< SCB UART_FLOW_CTRL: RTS_POLARITY (Bitfield-Mask: 0x01)    */
#define SCB_UART_FLOW_CTRL_CTS_POLARITY_Pos (24UL)              /*!< SCB UART_FLOW_CTRL: CTS_POLARITY (Bit 24)                 */
#define SCB_UART_FLOW_CTRL_CTS_POLARITY_Msk (0x1000000UL)       /*!< SCB UART_FLOW_CTRL: CTS_POLARITY (Bitfield-Mask: 0x01)    */
#define SCB_UART_FLOW_CTRL_CTS_ENABLED_Pos (25UL)               /*!< SCB UART_FLOW_CTRL: CTS_ENABLED (Bit 25)                  */
#define SCB_UART_FLOW_CTRL_CTS_ENABLED_Msk (0x2000000UL)        /*!< SCB UART_FLOW_CTRL: CTS_ENABLED (Bitfield-Mask: 0x01)     */
/* =====================================================  SCB.I2C_CTRL  ====================================================== */
#define SCB_I2C_CTRL_HIGH_PHASE_OVS_Pos   (0UL)                 /*!< SCB I2C_CTRL: HIGH_PHASE_OVS (Bit 0)                      */
#define SCB_I2C_CTRL_HIGH_PHASE_OVS_Msk   (0xfUL)               /*!< SCB I2C_CTRL: HIGH_PHASE_OVS (Bitfield-Mask: 0x0f)        */
#define SCB_I2C_CTRL_LOW_PHASE_OVS_Pos    (4UL)                 /*!< SCB I2C_CTRL: LOW_PHASE_OVS (Bit 4)                       */
#define SCB_I2C_CTRL_LOW_PHASE_OVS_Msk    (0xf0UL)              /*!< SCB I2C_CTRL: LOW_PHASE_OVS (Bitfield-Mask: 0x0f)         */
#define SCB_I2C_CTRL_M_READY_DATA_ACK_Pos (8UL)                 /*!< SCB I2C_CTRL: M_READY_DATA_ACK (Bit 8)                    */
#define SCB_I2C_CTRL_M_READY_DATA_ACK_Msk (0x100UL)             /*!< SCB I2C_CTRL: M_READY_DATA_ACK (Bitfield-Mask: 0x01)      */
#define SCB_I2C_CTRL_M_NOT_READY_DATA_NACK_Pos (9UL)            /*!< SCB I2C_CTRL: M_NOT_READY_DATA_NACK (Bit 9)               */
#define SCB_I2C_CTRL_M_NOT_READY_DATA_NACK_Msk (0x200UL)        /*!< SCB I2C_CTRL: M_NOT_READY_DATA_NACK (Bitfield-Mask: 0x01) */
#define SCB_I2C_CTRL_S_GENERAL_IGNORE_Pos (11UL)                /*!< SCB I2C_CTRL: S_GENERAL_IGNORE (Bit 11)                   */
#define SCB_I2C_CTRL_S_GENERAL_IGNORE_Msk (0x800UL)             /*!< SCB I2C_CTRL: S_GENERAL_IGNORE (Bitfield-Mask: 0x01)      */
#define SCB_I2C_CTRL_S_READY_ADDR_ACK_Pos (12UL)                /*!< SCB I2C_CTRL: S_READY_ADDR_ACK (Bit 12)                   */
#define SCB_I2C_CTRL_S_READY_ADDR_ACK_Msk (0x1000UL)            /*!< SCB I2C_CTRL: S_READY_ADDR_ACK (Bitfield-Mask: 0x01)      */
#define SCB_I2C_CTRL_S_READY_DATA_ACK_Pos (13UL)                /*!< SCB I2C_CTRL: S_READY_DATA_ACK (Bit 13)                   */
#define SCB_I2C_CTRL_S_READY_DATA_ACK_Msk (0x2000UL)            /*!< SCB I2C_CTRL: S_READY_DATA_ACK (Bitfield-Mask: 0x01)      */
#define SCB_I2C_CTRL_S_NOT_READY_ADDR_NACK_Pos (14UL)           /*!< SCB I2C_CTRL: S_NOT_READY_ADDR_NACK (Bit 14)              */
#define SCB_I2C_CTRL_S_NOT_READY_ADDR_NACK_Msk (0x4000UL)       /*!< SCB I2C_CTRL: S_NOT_READY_ADDR_NACK (Bitfield-Mask: 0x01) */
#define SCB_I2C_CTRL_S_NOT_READY_DATA_NACK_Pos (15UL)           /*!< SCB I2C_CTRL: S_NOT_READY_DATA_NACK (Bit 15)              */
#define SCB_I2C_CTRL_S_NOT_READY_DATA_NACK_Msk (0x8000UL)       /*!< SCB I2C_CTRL: S_NOT_READY_DATA_NACK (Bitfield-Mask: 0x01) */
#define SCB_I2C_CTRL_LOOPBACK_Pos         (16UL)                /*!< SCB I2C_CTRL: LOOPBACK (Bit 16)                           */
#define SCB_I2C_CTRL_LOOPBACK_Msk         (0x10000UL)           /*!< SCB I2C_CTRL: LOOPBACK (Bitfield-Mask: 0x01)              */
#define SCB_I2C_CTRL_SLAVE_MODE_Pos       (30UL)                /*!< SCB I2C_CTRL: SLAVE_MODE (Bit 30)                         */
#define SCB_I2C_CTRL_SLAVE_MODE_Msk       (0x40000000UL)        /*!< SCB I2C_CTRL: SLAVE_MODE (Bitfield-Mask: 0x01)            */
#define SCB_I2C_CTRL_MASTER_MODE_Pos      (31UL)                /*!< SCB I2C_CTRL: MASTER_MODE (Bit 31)                        */
#define SCB_I2C_CTRL_MASTER_MODE_Msk      (0x80000000UL)        /*!< SCB I2C_CTRL: MASTER_MODE (Bitfield-Mask: 0x01)           */
/* ====================================================  SCB.I2C_STATUS  ===================================================== */
#define SCB_I2C_STATUS_BUS_BUSY_Pos       (0UL)                 /*!< SCB I2C_STATUS: BUS_BUSY (Bit 0)                          */
#define SCB_I2C_STATUS_BUS_BUSY_Msk       (0x1UL)               /*!< SCB I2C_STATUS: BUS_BUSY (Bitfield-Mask: 0x01)            */
#define SCB_I2C_STATUS_I2C_EC_BUSY_Pos    (1UL)                 /*!< SCB I2C_STATUS: I2C_EC_BUSY (Bit 1)                       */
#define SCB_I2C_STATUS_I2C_EC_BUSY_Msk    (0x2UL)               /*!< SCB I2C_STATUS: I2C_EC_BUSY (Bitfield-Mask: 0x01)         */
#define SCB_I2C_STATUS_S_READ_Pos         (4UL)                 /*!< SCB I2C_STATUS: S_READ (Bit 4)                            */
#define SCB_I2C_STATUS_S_READ_Msk         (0x10UL)              /*!< SCB I2C_STATUS: S_READ (Bitfield-Mask: 0x01)              */
#define SCB_I2C_STATUS_M_READ_Pos         (5UL)                 /*!< SCB I2C_STATUS: M_READ (Bit 5)                            */
#define SCB_I2C_STATUS_M_READ_Msk         (0x20UL)              /*!< SCB I2C_STATUS: M_READ (Bitfield-Mask: 0x01)              */
#define SCB_I2C_STATUS_CURR_EZ_ADDR_Pos   (8UL)                 /*!< SCB I2C_STATUS: CURR_EZ_ADDR (Bit 8)                      */
#define SCB_I2C_STATUS_CURR_EZ_ADDR_Msk   (0xff00UL)            /*!< SCB I2C_STATUS: CURR_EZ_ADDR (Bitfield-Mask: 0xff)        */
#define SCB_I2C_STATUS_BASE_EZ_ADDR_Pos   (16UL)                /*!< SCB I2C_STATUS: BASE_EZ_ADDR (Bit 16)                     */
#define SCB_I2C_STATUS_BASE_EZ_ADDR_Msk   (0xff0000UL)          /*!< SCB I2C_STATUS: BASE_EZ_ADDR (Bitfield-Mask: 0xff)        */
/* =====================================================  SCB.I2C_M_CMD  ===================================================== */
#define SCB_I2C_M_CMD_M_START_Pos         (0UL)                 /*!< SCB I2C_M_CMD: M_START (Bit 0)                            */
#define SCB_I2C_M_CMD_M_START_Msk         (0x1UL)               /*!< SCB I2C_M_CMD: M_START (Bitfield-Mask: 0x01)              */
#define SCB_I2C_M_CMD_M_START_ON_IDLE_Pos (1UL)                 /*!< SCB I2C_M_CMD: M_START_ON_IDLE (Bit 1)                    */
#define SCB_I2C_M_CMD_M_START_ON_IDLE_Msk (0x2UL)               /*!< SCB I2C_M_CMD: M_START_ON_IDLE (Bitfield-Mask: 0x01)      */
#define SCB_I2C_M_CMD_M_ACK_Pos           (2UL)                 /*!< SCB I2C_M_CMD: M_ACK (Bit 2)                              */
#define SCB_I2C_M_CMD_M_ACK_Msk           (0x4UL)               /*!< SCB I2C_M_CMD: M_ACK (Bitfield-Mask: 0x01)                */
#define SCB_I2C_M_CMD_M_NACK_Pos          (3UL)                 /*!< SCB I2C_M_CMD: M_NACK (Bit 3)                             */
#define SCB_I2C_M_CMD_M_NACK_Msk          (0x8UL)               /*!< SCB I2C_M_CMD: M_NACK (Bitfield-Mask: 0x01)               */
#define SCB_I2C_M_CMD_M_STOP_Pos          (4UL)                 /*!< SCB I2C_M_CMD: M_STOP (Bit 4)                             */
#define SCB_I2C_M_CMD_M_STOP_Msk          (0x10UL)              /*!< SCB I2C_M_CMD: M_STOP (Bitfield-Mask: 0x01)               */
/* =====================================================  SCB.I2C_S_CMD  ===================================================== */
#define SCB_I2C_S_CMD_S_ACK_Pos           (0UL)                 /*!< SCB I2C_S_CMD: S_ACK (Bit 0)                              */
#define SCB_I2C_S_CMD_S_ACK_Msk           (0x1UL)               /*!< SCB I2C_S_CMD: S_ACK (Bitfield-Mask: 0x01)                */
#define SCB_I2C_S_CMD_S_NACK_Pos          (1UL)                 /*!< SCB I2C_S_CMD: S_NACK (Bit 1)                             */
#define SCB_I2C_S_CMD_S_NACK_Msk          (0x2UL)               /*!< SCB I2C_S_CMD: S_NACK (Bitfield-Mask: 0x01)               */
/* ======================================================  SCB.I2C_CFG  ====================================================== */
#define SCB_I2C_CFG_SDA_IN_FILT_TRIM_Pos  (0UL)                 /*!< SCB I2C_CFG: SDA_IN_FILT_TRIM (Bit 0)                     */
#define SCB_I2C_CFG_SDA_IN_FILT_TRIM_Msk  (0x3UL)               /*!< SCB I2C_CFG: SDA_IN_FILT_TRIM (Bitfield-Mask: 0x03)       */
#define SCB_I2C_CFG_SDA_IN_FILT_SEL_Pos   (4UL)                 /*!< SCB I2C_CFG: SDA_IN_FILT_SEL (Bit 4)                      */
#define SCB_I2C_CFG_SDA_IN_FILT_SEL_Msk   (0x10UL)              /*!< SCB I2C_CFG: SDA_IN_FILT_SEL (Bitfield-Mask: 0x01)        */
#define SCB_I2C_CFG_SCL_IN_FILT_TRIM_Pos  (8UL)                 /*!< SCB I2C_CFG: SCL_IN_FILT_TRIM (Bit 8)                     */
#define SCB_I2C_CFG_SCL_IN_FILT_TRIM_Msk  (0x300UL)             /*!< SCB I2C_CFG: SCL_IN_FILT_TRIM (Bitfield-Mask: 0x03)       */
