ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_scb.h
#define SCB_I2C_CFG_SCL_IN_FILT_SEL_Pos   (12UL)                /*!< SCB I2C_CFG: SCL_IN_FILT_SEL (Bit 12)                     */
#define SCB_I2C_CFG_SCL_IN_FILT_SEL_Msk   (0x1000UL)            /*!< SCB I2C_CFG: SCL_IN_FILT_SEL (Bitfield-Mask: 0x01)        */
#define SCB_I2C_CFG_SDA_OUT_FILT0_TRIM_Pos (16UL)               /*!< SCB I2C_CFG: SDA_OUT_FILT0_TRIM (Bit 16)                  */
#define SCB_I2C_CFG_SDA_OUT_FILT0_TRIM_Msk (0x30000UL)          /*!< SCB I2C_CFG: SDA_OUT_FILT0_TRIM (Bitfield-Mask: 0x03)     */
#define SCB_I2C_CFG_SDA_OUT_FILT1_TRIM_Pos (18UL)               /*!< SCB I2C_CFG: SDA_OUT_FILT1_TRIM (Bit 18)                  */
#define SCB_I2C_CFG_SDA_OUT_FILT1_TRIM_Msk (0xc0000UL)          /*!< SCB I2C_CFG: SDA_OUT_FILT1_TRIM (Bitfield-Mask: 0x03)     */
#define SCB_I2C_CFG_SDA_OUT_FILT2_TRIM_Pos (20UL)               /*!< SCB I2C_CFG: SDA_OUT_FILT2_TRIM (Bit 20)                  */
#define SCB_I2C_CFG_SDA_OUT_FILT2_TRIM_Msk (0x300000UL)         /*!< SCB I2C_CFG: SDA_OUT_FILT2_TRIM (Bitfield-Mask: 0x03)     */
#define SCB_I2C_CFG_SDA_OUT_FILT_SEL_Pos  (28UL)                /*!< SCB I2C_CFG: SDA_OUT_FILT_SEL (Bit 28)                    */
#define SCB_I2C_CFG_SDA_OUT_FILT_SEL_Msk  (0x30000000UL)        /*!< SCB I2C_CFG: SDA_OUT_FILT_SEL (Bitfield-Mask: 0x03)       */
/* =====================================================  SCB.DDFT_CTRL  ===================================================== */
#define SCB_DDFT_CTRL_DDFT_IN0_SEL_Pos    (0UL)                 /*!< SCB DDFT_CTRL: DDFT_IN0_SEL (Bit 0)                       */
#define SCB_DDFT_CTRL_DDFT_IN0_SEL_Msk    (0x1UL)               /*!< SCB DDFT_CTRL: DDFT_IN0_SEL (Bitfield-Mask: 0x01)         */
#define SCB_DDFT_CTRL_DDFT_IN1_SEL_Pos    (4UL)                 /*!< SCB DDFT_CTRL: DDFT_IN1_SEL (Bit 4)                       */
#define SCB_DDFT_CTRL_DDFT_IN1_SEL_Msk    (0x10UL)              /*!< SCB DDFT_CTRL: DDFT_IN1_SEL (Bitfield-Mask: 0x01)         */
#define SCB_DDFT_CTRL_DDFT_OUT0_SEL_Pos   (16UL)                /*!< SCB DDFT_CTRL: DDFT_OUT0_SEL (Bit 16)                     */
#define SCB_DDFT_CTRL_DDFT_OUT0_SEL_Msk   (0x70000UL)           /*!< SCB DDFT_CTRL: DDFT_OUT0_SEL (Bitfield-Mask: 0x07)        */
#define SCB_DDFT_CTRL_DDFT_OUT1_SEL_Pos   (20UL)                /*!< SCB DDFT_CTRL: DDFT_OUT1_SEL (Bit 20)                     */
#define SCB_DDFT_CTRL_DDFT_OUT1_SEL_Msk   (0x700000UL)          /*!< SCB DDFT_CTRL: DDFT_OUT1_SEL (Bitfield-Mask: 0x07)        */
/* ======================================================  SCB.TX_CTRL  ====================================================== */
#define SCB_TX_CTRL_DATA_WIDTH_Pos        (0UL)                 /*!< SCB TX_CTRL: DATA_WIDTH (Bit 0)                           */
#define SCB_TX_CTRL_DATA_WIDTH_Msk        (0xfUL)               /*!< SCB TX_CTRL: DATA_WIDTH (Bitfield-Mask: 0x0f)             */
#define SCB_TX_CTRL_MSB_FIRST_Pos         (8UL)                 /*!< SCB TX_CTRL: MSB_FIRST (Bit 8)                            */
#define SCB_TX_CTRL_MSB_FIRST_Msk         (0x100UL)             /*!< SCB TX_CTRL: MSB_FIRST (Bitfield-Mask: 0x01)              */
/* ===================================================  SCB.TX_FIFO_CTRL  ==================================================== */
#define SCB_TX_FIFO_CTRL_TRIGGER_LEVEL_Pos (0UL)                /*!< SCB TX_FIFO_CTRL: TRIGGER_LEVEL (Bit 0)                   */
#define SCB_TX_FIFO_CTRL_TRIGGER_LEVEL_Msk (0xffUL)             /*!< SCB TX_FIFO_CTRL: TRIGGER_LEVEL (Bitfield-Mask: 0xff)     */
#define SCB_TX_FIFO_CTRL_CLEAR_Pos        (16UL)                /*!< SCB TX_FIFO_CTRL: CLEAR (Bit 16)                          */
#define SCB_TX_FIFO_CTRL_CLEAR_Msk        (0x10000UL)           /*!< SCB TX_FIFO_CTRL: CLEAR (Bitfield-Mask: 0x01)             */
#define SCB_TX_FIFO_CTRL_FREEZE_Pos       (17UL)                /*!< SCB TX_FIFO_CTRL: FREEZE (Bit 17)                         */
#define SCB_TX_FIFO_CTRL_FREEZE_Msk       (0x20000UL)           /*!< SCB TX_FIFO_CTRL: FREEZE (Bitfield-Mask: 0x01)            */
/* ==================================================  SCB.TX_FIFO_STATUS  =================================================== */
#define SCB_TX_FIFO_STATUS_USED_Pos       (0UL)                 /*!< SCB TX_FIFO_STATUS: USED (Bit 0)                          */
#define SCB_TX_FIFO_STATUS_USED_Msk       (0x1ffUL)             /*!< SCB TX_FIFO_STATUS: USED (Bitfield-Mask: 0x1ff)           */
#define SCB_TX_FIFO_STATUS_SR_VALID_Pos   (15UL)                /*!< SCB TX_FIFO_STATUS: SR_VALID (Bit 15)                     */
#define SCB_TX_FIFO_STATUS_SR_VALID_Msk   (0x8000UL)            /*!< SCB TX_FIFO_STATUS: SR_VALID (Bitfield-Mask: 0x01)        */
#define SCB_TX_FIFO_STATUS_RD_PTR_Pos     (16UL)                /*!< SCB TX_FIFO_STATUS: RD_PTR (Bit 16)                       */
#define SCB_TX_FIFO_STATUS_RD_PTR_Msk     (0xff0000UL)          /*!< SCB TX_FIFO_STATUS: RD_PTR (Bitfield-Mask: 0xff)          */
#define SCB_TX_FIFO_STATUS_WR_PTR_Pos     (24UL)                /*!< SCB TX_FIFO_STATUS: WR_PTR (Bit 24)                       */
#define SCB_TX_FIFO_STATUS_WR_PTR_Msk     (0xff000000UL)        /*!< SCB TX_FIFO_STATUS: WR_PTR (Bitfield-Mask: 0xff)          */
/* ====================================================  SCB.TX_FIFO_WR  ===================================================== */
#define SCB_TX_FIFO_WR_DATA_Pos           (0UL)                 /*!< SCB TX_FIFO_WR: DATA (Bit 0)                              */
#define SCB_TX_FIFO_WR_DATA_Msk           (0xffffUL)            /*!< SCB TX_FIFO_WR: DATA (Bitfield-Mask: 0xffff)              */
/* ======================================================  SCB.RX_CTRL  ====================================================== */
#define SCB_RX_CTRL_DATA_WIDTH_Pos        (0UL)                 /*!< SCB RX_CTRL: DATA_WIDTH (Bit 0)                           */
#define SCB_RX_CTRL_DATA_WIDTH_Msk        (0xfUL)               /*!< SCB RX_CTRL: DATA_WIDTH (Bitfield-Mask: 0x0f)             */
#define SCB_RX_CTRL_MSB_FIRST_Pos         (8UL)                 /*!< SCB RX_CTRL: MSB_FIRST (Bit 8)                            */
#define SCB_RX_CTRL_MSB_FIRST_Msk         (0x100UL)             /*!< SCB RX_CTRL: MSB_FIRST (Bitfield-Mask: 0x01)              */
#define SCB_RX_CTRL_MEDIAN_Pos            (9UL)                 /*!< SCB RX_CTRL: MEDIAN (Bit 9)                               */
#define SCB_RX_CTRL_MEDIAN_Msk            (0x200UL)             /*!< SCB RX_CTRL: MEDIAN (Bitfield-Mask: 0x01)                 */
/* ===================================================  SCB.RX_FIFO_CTRL  ==================================================== */
#define SCB_RX_FIFO_CTRL_TRIGGER_LEVEL_Pos (0UL)                /*!< SCB RX_FIFO_CTRL: TRIGGER_LEVEL (Bit 0)                   */
#define SCB_RX_FIFO_CTRL_TRIGGER_LEVEL_Msk (0xffUL)             /*!< SCB RX_FIFO_CTRL: TRIGGER_LEVEL (Bitfield-Mask: 0xff)     */
#define SCB_RX_FIFO_CTRL_CLEAR_Pos        (16UL)                /*!< SCB RX_FIFO_CTRL: CLEAR (Bit 16)                          */
#define SCB_RX_FIFO_CTRL_CLEAR_Msk        (0x10000UL)           /*!< SCB RX_FIFO_CTRL: CLEAR (Bitfield-Mask: 0x01)             */
#define SCB_RX_FIFO_CTRL_FREEZE_Pos       (17UL)                /*!< SCB RX_FIFO_CTRL: FREEZE (Bit 17)                         */
#define SCB_RX_FIFO_CTRL_FREEZE_Msk       (0x20000UL)           /*!< SCB RX_FIFO_CTRL: FREEZE (Bitfield-Mask: 0x01)            */
/* ==================================================  SCB.RX_FIFO_STATUS  =================================================== */
#define SCB_RX_FIFO_STATUS_USED_Pos       (0UL)                 /*!< SCB RX_FIFO_STATUS: USED (Bit 0)                          */
#define SCB_RX_FIFO_STATUS_USED_Msk       (0x1ffUL)             /*!< SCB RX_FIFO_STATUS: USED (Bitfield-Mask: 0x1ff)           */
#define SCB_RX_FIFO_STATUS_SR_VALID_Pos   (15UL)                /*!< SCB RX_FIFO_STATUS: SR_VALID (Bit 15)                     */
#define SCB_RX_FIFO_STATUS_SR_VALID_Msk   (0x8000UL)            /*!< SCB RX_FIFO_STATUS: SR_VALID (Bitfield-Mask: 0x01)        */
#define SCB_RX_FIFO_STATUS_RD_PTR_Pos     (16UL)                /*!< SCB RX_FIFO_STATUS: RD_PTR (Bit 16)                       */
#define SCB_RX_FIFO_STATUS_RD_PTR_Msk     (0xff0000UL)          /*!< SCB RX_FIFO_STATUS: RD_PTR (Bitfield-Mask: 0xff)          */
#define SCB_RX_FIFO_STATUS_WR_PTR_Pos     (24UL)                /*!< SCB RX_FIFO_STATUS: WR_PTR (Bit 24)                       */
#define SCB_RX_FIFO_STATUS_WR_PTR_Msk     (0xff000000UL)        /*!< SCB RX_FIFO_STATUS: WR_PTR (Bitfield-Mask: 0xff)          */
/* =====================================================  SCB.RX_MATCH  ====================================================== */
#define SCB_RX_MATCH_ADDR_Pos             (0UL)                 /*!< SCB RX_MATCH: ADDR (Bit 0)                                */
#define SCB_RX_MATCH_ADDR_Msk             (0xffUL)              /*!< SCB RX_MATCH: ADDR (Bitfield-Mask: 0xff)                  */
#define SCB_RX_MATCH_MASK_Pos             (16UL)                /*!< SCB RX_MATCH: MASK (Bit 16)                               */
#define SCB_RX_MATCH_MASK_Msk             (0xff0000UL)          /*!< SCB RX_MATCH: MASK (Bitfield-Mask: 0xff)                  */
/* ====================================================  SCB.RX_FIFO_RD  ===================================================== */
#define SCB_RX_FIFO_RD_DATA_Pos           (0UL)                 /*!< SCB RX_FIFO_RD: DATA (Bit 0)                              */
#define SCB_RX_FIFO_RD_DATA_Msk           (0xffffUL)            /*!< SCB RX_FIFO_RD: DATA (Bitfield-Mask: 0xffff)              */
/* =================================================  SCB.RX_FIFO_RD_SILENT  ================================================= */
#define SCB_RX_FIFO_RD_SILENT_DATA_Pos    (0UL)                 /*!< SCB RX_FIFO_RD_SILENT: DATA (Bit 0)                       */
#define SCB_RX_FIFO_RD_SILENT_DATA_Msk    (0xffffUL)            /*!< SCB RX_FIFO_RD_SILENT: DATA (Bitfield-Mask: 0xffff)       */
/* ======================================================  SCB.EZ_DATA  ====================================================== */
#define SCB_EZ_DATA_EZ_DATA_Pos           (0UL)                 /*!< SCB EZ_DATA: EZ_DATA (Bit 0)                              */
#define SCB_EZ_DATA_EZ_DATA_Msk           (0xffUL)              /*!< SCB EZ_DATA: EZ_DATA (Bitfield-Mask: 0xff)                */
/* ====================================================  SCB.INTR_CAUSE  ===================================================== */
#define SCB_INTR_CAUSE_M_Pos              (0UL)                 /*!< SCB INTR_CAUSE: M (Bit 0)                                 */
#define SCB_INTR_CAUSE_M_Msk              (0x1UL)               /*!< SCB INTR_CAUSE: M (Bitfield-Mask: 0x01)                   */
#define SCB_INTR_CAUSE_S_Pos              (1UL)                 /*!< SCB INTR_CAUSE: S (Bit 1)                                 */
#define SCB_INTR_CAUSE_S_Msk              (0x2UL)               /*!< SCB INTR_CAUSE: S (Bitfield-Mask: 0x01)                   */
#define SCB_INTR_CAUSE_TX_Pos             (2UL)                 /*!< SCB INTR_CAUSE: TX (Bit 2)                                */
#define SCB_INTR_CAUSE_TX_Msk             (0x4UL)               /*!< SCB INTR_CAUSE: TX (Bitfield-Mask: 0x01)                  */
#define SCB_INTR_CAUSE_RX_Pos             (3UL)                 /*!< SCB INTR_CAUSE: RX (Bit 3)                                */
#define SCB_INTR_CAUSE_RX_Msk             (0x8UL)               /*!< SCB INTR_CAUSE: RX (Bitfield-Mask: 0x01)                  */
#define SCB_INTR_CAUSE_I2C_EC_Pos         (4UL)                 /*!< SCB INTR_CAUSE: I2C_EC (Bit 4)                            */
#define SCB_INTR_CAUSE_I2C_EC_Msk         (0x10UL)              /*!< SCB INTR_CAUSE: I2C_EC (Bitfield-Mask: 0x01)              */
#define SCB_INTR_CAUSE_SPI_EC_Pos         (5UL)                 /*!< SCB INTR_CAUSE: SPI_EC (Bit 5)                            */
#define SCB_INTR_CAUSE_SPI_EC_Msk         (0x20UL)              /*!< SCB INTR_CAUSE: SPI_EC (Bitfield-Mask: 0x01)              */
/* ====================================================  SCB.INTR_I2C_EC  ==================================================== */
#define SCB_INTR_I2C_EC_WAKE_UP_Pos       (0UL)                 /*!< SCB INTR_I2C_EC: WAKE_UP (Bit 0)                          */
#define SCB_INTR_I2C_EC_WAKE_UP_Msk       (0x1UL)               /*!< SCB INTR_I2C_EC: WAKE_UP (Bitfield-Mask: 0x01)            */
#define SCB_INTR_I2C_EC_EZ_STOP_Pos       (1UL)                 /*!< SCB INTR_I2C_EC: EZ_STOP (Bit 1)                          */
#define SCB_INTR_I2C_EC_EZ_STOP_Msk       (0x2UL)               /*!< SCB INTR_I2C_EC: EZ_STOP (Bitfield-Mask: 0x01)            */
#define SCB_INTR_I2C_EC_EZ_WRITE_STOP_Pos (2UL)                 /*!< SCB INTR_I2C_EC: EZ_WRITE_STOP (Bit 2)                    */
#define SCB_INTR_I2C_EC_EZ_WRITE_STOP_Msk (0x4UL)               /*!< SCB INTR_I2C_EC: EZ_WRITE_STOP (Bitfield-Mask: 0x01)      */
#define SCB_INTR_I2C_EC_EZ_READ_STOP_Pos  (3UL)                 /*!< SCB INTR_I2C_EC: EZ_READ_STOP (Bit 3)                     */
#define SCB_INTR_I2C_EC_EZ_READ_STOP_Msk  (0x8UL)               /*!< SCB INTR_I2C_EC: EZ_READ_STOP (Bitfield-Mask: 0x01)       */
/* =================================================  SCB.INTR_I2C_EC_MASK  ================================================== */
#define SCB_INTR_I2C_EC_MASK_WAKE_UP_Pos  (0UL)                 /*!< SCB INTR_I2C_EC_MASK: WAKE_UP (Bit 0)                     */
#define SCB_INTR_I2C_EC_MASK_WAKE_UP_Msk  (0x1UL)               /*!< SCB INTR_I2C_EC_MASK: WAKE_UP (Bitfield-Mask: 0x01)       */
#define SCB_INTR_I2C_EC_MASK_EZ_STOP_Pos  (1UL)                 /*!< SCB INTR_I2C_EC_MASK: EZ_STOP (Bit 1)                     */
#define SCB_INTR_I2C_EC_MASK_EZ_STOP_Msk  (0x2UL)               /*!< SCB INTR_I2C_EC_MASK: EZ_STOP (Bitfield-Mask: 0x01)       */
#define SCB_INTR_I2C_EC_MASK_EZ_WRITE_STOP_Pos (2UL)            /*!< SCB INTR_I2C_EC_MASK: EZ_WRITE_STOP (Bit 2)               */
#define SCB_INTR_I2C_EC_MASK_EZ_WRITE_STOP_Msk (0x4UL)          /*!< SCB INTR_I2C_EC_MASK: EZ_WRITE_STOP (Bitfield-Mask: 0x01) */
#define SCB_INTR_I2C_EC_MASK_EZ_READ_STOP_Pos (3UL)             /*!< SCB INTR_I2C_EC_MASK: EZ_READ_STOP (Bit 3)                */
#define SCB_INTR_I2C_EC_MASK_EZ_READ_STOP_Msk (0x8UL)           /*!< SCB INTR_I2C_EC_MASK: EZ_READ_STOP (Bitfield-Mask: 0x01)  */
/* ================================================  SCB.INTR_I2C_EC_MASKED  ================================================= */
#define SCB_INTR_I2C_EC_MASKED_WAKE_UP_Pos (0UL)                /*!< SCB INTR_I2C_EC_MASKED: WAKE_UP (Bit 0)                   */
#define SCB_INTR_I2C_EC_MASKED_WAKE_UP_Msk (0x1UL)              /*!< SCB INTR_I2C_EC_MASKED: WAKE_UP (Bitfield-Mask: 0x01)     */
#define SCB_INTR_I2C_EC_MASKED_EZ_STOP_Pos (1UL)                /*!< SCB INTR_I2C_EC_MASKED: EZ_STOP (Bit 1)                   */
#define SCB_INTR_I2C_EC_MASKED_EZ_STOP_Msk (0x2UL)              /*!< SCB INTR_I2C_EC_MASKED: EZ_STOP (Bitfield-Mask: 0x01)     */
#define SCB_INTR_I2C_EC_MASKED_EZ_WRITE_STOP_Pos (2UL)          /*!< SCB INTR_I2C_EC_MASKED: EZ_WRITE_STOP (Bit 2)             */
#define SCB_INTR_I2C_EC_MASKED_EZ_WRITE_STOP_Msk (0x4UL)        /*!< SCB INTR_I2C_EC_MASKED: EZ_WRITE_STOP (Bitfield-Mask: 0x01)*/
#define SCB_INTR_I2C_EC_MASKED_EZ_READ_STOP_Pos (3UL)           /*!< SCB INTR_I2C_EC_MASKED: EZ_READ_STOP (Bit 3)              */
#define SCB_INTR_I2C_EC_MASKED_EZ_READ_STOP_Msk (0x8UL)         /*!< SCB INTR_I2C_EC_MASKED: EZ_READ_STOP (Bitfield-Mask: 0x01)*/
/* ====================================================  SCB.INTR_SPI_EC  ==================================================== */
#define SCB_INTR_SPI_EC_WAKE_UP_Pos       (0UL)                 /*!< SCB INTR_SPI_EC: WAKE_UP (Bit 0)                          */
#define SCB_INTR_SPI_EC_WAKE_UP_Msk       (0x1UL)               /*!< SCB INTR_SPI_EC: WAKE_UP (Bitfield-Mask: 0x01)            */
#define SCB_INTR_SPI_EC_EZ_STOP_Pos       (1UL)                 /*!< SCB INTR_SPI_EC: EZ_STOP (Bit 1)                          */
#define SCB_INTR_SPI_EC_EZ_STOP_Msk       (0x2UL)               /*!< SCB INTR_SPI_EC: EZ_STOP (Bitfield-Mask: 0x01)            */
#define SCB_INTR_SPI_EC_EZ_WRITE_STOP_Pos (2UL)                 /*!< SCB INTR_SPI_EC: EZ_WRITE_STOP (Bit 2)                    */
#define SCB_INTR_SPI_EC_EZ_WRITE_STOP_Msk (0x4UL)               /*!< SCB INTR_SPI_EC: EZ_WRITE_STOP (Bitfield-Mask: 0x01)      */
#define SCB_INTR_SPI_EC_EZ_READ_STOP_Pos  (3UL)                 /*!< SCB INTR_SPI_EC: EZ_READ_STOP (Bit 3)                     */
#define SCB_INTR_SPI_EC_EZ_READ_STOP_Msk  (0x8UL)               /*!< SCB INTR_SPI_EC: EZ_READ_STOP (Bitfield-Mask: 0x01)       */
/* =================================================  SCB.INTR_SPI_EC_MASK  ================================================== */
#define SCB_INTR_SPI_EC_MASK_WAKE_UP_Pos  (0UL)                 /*!< SCB INTR_SPI_EC_MASK: WAKE_UP (Bit 0)                     */
#define SCB_INTR_SPI_EC_MASK_WAKE_UP_Msk  (0x1UL)               /*!< SCB INTR_SPI_EC_MASK: WAKE_UP (Bitfield-Mask: 0x01)       */
#define SCB_INTR_SPI_EC_MASK_EZ_STOP_Pos  (1UL)                 /*!< SCB INTR_SPI_EC_MASK: EZ_STOP (Bit 1)                     */
#define SCB_INTR_SPI_EC_MASK_EZ_STOP_Msk  (0x2UL)               /*!< SCB INTR_SPI_EC_MASK: EZ_STOP (Bitfield-Mask: 0x01)       */
#define SCB_INTR_SPI_EC_MASK_EZ_WRITE_STOP_Pos (2UL)            /*!< SCB INTR_SPI_EC_MASK: EZ_WRITE_STOP (Bit 2)               */
#define SCB_INTR_SPI_EC_MASK_EZ_WRITE_STOP_Msk (0x4UL)          /*!< SCB INTR_SPI_EC_MASK: EZ_WRITE_STOP (Bitfield-Mask: 0x01) */
#define SCB_INTR_SPI_EC_MASK_EZ_READ_STOP_Pos (3UL)             /*!< SCB INTR_SPI_EC_MASK: EZ_READ_STOP (Bit 3)                */
#define SCB_INTR_SPI_EC_MASK_EZ_READ_STOP_Msk (0x8UL)           /*!< SCB INTR_SPI_EC_MASK: EZ_READ_STOP (Bitfield-Mask: 0x01)  */
/* ================================================  SCB.INTR_SPI_EC_MASKED  ================================================= */
#define SCB_INTR_SPI_EC_MASKED_WAKE_UP_Pos (0UL)                /*!< SCB INTR_SPI_EC_MASKED: WAKE_UP (Bit 0)                   */
#define SCB_INTR_SPI_EC_MASKED_WAKE_UP_Msk (0x1UL)              /*!< SCB INTR_SPI_EC_MASKED: WAKE_UP (Bitfield-Mask: 0x01)     */
#define SCB_INTR_SPI_EC_MASKED_EZ_STOP_Pos (1UL)                /*!< SCB INTR_SPI_EC_MASKED: EZ_STOP (Bit 1)                   */
#define SCB_INTR_SPI_EC_MASKED_EZ_STOP_Msk (0x2UL)              /*!< SCB INTR_SPI_EC_MASKED: EZ_STOP (Bitfield-Mask: 0x01)     */
#define SCB_INTR_SPI_EC_MASKED_EZ_WRITE_STOP_Pos (2UL)          /*!< SCB INTR_SPI_EC_MASKED: EZ_WRITE_STOP (Bit 2)             */
#define SCB_INTR_SPI_EC_MASKED_EZ_WRITE_STOP_Msk (0x4UL)        /*!< SCB INTR_SPI_EC_MASKED: EZ_WRITE_STOP (Bitfield-Mask: 0x01)*/
#define SCB_INTR_SPI_EC_MASKED_EZ_READ_STOP_Pos (3UL)           /*!< SCB INTR_SPI_EC_MASKED: EZ_READ_STOP (Bit 3)              */
#define SCB_INTR_SPI_EC_MASKED_EZ_READ_STOP_Msk (0x8UL)         /*!< SCB INTR_SPI_EC_MASKED: EZ_READ_STOP (Bitfield-Mask: 0x01)*/
/* ======================================================  SCB.INTR_M  ======================================================= */
#define SCB_INTR_M_I2C_ARB_LOST_Pos       (0UL)                 /*!< SCB INTR_M: I2C_ARB_LOST (Bit 0)                          */
#define SCB_INTR_M_I2C_ARB_LOST_Msk       (0x1UL)               /*!< SCB INTR_M: I2C_ARB_LOST (Bitfield-Mask: 0x01)            */
#define SCB_INTR_M_I2C_NACK_Pos           (1UL)                 /*!< SCB INTR_M: I2C_NACK (Bit 1)                              */
#define SCB_INTR_M_I2C_NACK_Msk           (0x2UL)               /*!< SCB INTR_M: I2C_NACK (Bitfield-Mask: 0x01)                */
#define SCB_INTR_M_I2C_ACK_Pos            (2UL)                 /*!< SCB INTR_M: I2C_ACK (Bit 2)                               */
#define SCB_INTR_M_I2C_ACK_Msk            (0x4UL)               /*!< SCB INTR_M: I2C_ACK (Bitfield-Mask: 0x01)                 */
#define SCB_INTR_M_I2C_STOP_Pos           (4UL)                 /*!< SCB INTR_M: I2C_STOP (Bit 4)                              */
#define SCB_INTR_M_I2C_STOP_Msk           (0x10UL)              /*!< SCB INTR_M: I2C_STOP (Bitfield-Mask: 0x01)                */
#define SCB_INTR_M_I2C_BUS_ERROR_Pos      (8UL)                 /*!< SCB INTR_M: I2C_BUS_ERROR (Bit 8)                         */
#define SCB_INTR_M_I2C_BUS_ERROR_Msk      (0x100UL)             /*!< SCB INTR_M: I2C_BUS_ERROR (Bitfield-Mask: 0x01)           */
#define SCB_INTR_M_SPI_DONE_Pos           (9UL)                 /*!< SCB INTR_M: SPI_DONE (Bit 9)                              */
#define SCB_INTR_M_SPI_DONE_Msk           (0x200UL)             /*!< SCB INTR_M: SPI_DONE (Bitfield-Mask: 0x01)                */
/* ====================================================  SCB.INTR_M_SET  ===================================================== */
#define SCB_INTR_M_SET_I2C_ARB_LOST_Pos   (0UL)                 /*!< SCB INTR_M_SET: I2C_ARB_LOST (Bit 0)                      */
#define SCB_INTR_M_SET_I2C_ARB_LOST_Msk   (0x1UL)               /*!< SCB INTR_M_SET: I2C_ARB_LOST (Bitfield-Mask: 0x01)        */
#define SCB_INTR_M_SET_I2C_NACK_Pos       (1UL)                 /*!< SCB INTR_M_SET: I2C_NACK (Bit 1)                          */
#define SCB_INTR_M_SET_I2C_NACK_Msk       (0x2UL)               /*!< SCB INTR_M_SET: I2C_NACK (Bitfield-Mask: 0x01)            */
#define SCB_INTR_M_SET_I2C_ACK_Pos        (2UL)                 /*!< SCB INTR_M_SET: I2C_ACK (Bit 2)                           */
#define SCB_INTR_M_SET_I2C_ACK_Msk        (0x4UL)               /*!< SCB INTR_M_SET: I2C_ACK (Bitfield-Mask: 0x01)             */
#define SCB_INTR_M_SET_I2C_STOP_Pos       (4UL)                 /*!< SCB INTR_M_SET: I2C_STOP (Bit 4)                          */
#define SCB_INTR_M_SET_I2C_STOP_Msk       (0x10UL)              /*!< SCB INTR_M_SET: I2C_STOP (Bitfield-Mask: 0x01)            */
#define SCB_INTR_M_SET_I2C_BUS_ERROR_Pos  (8UL)                 /*!< SCB INTR_M_SET: I2C_BUS_ERROR (Bit 8)                     */
#define SCB_INTR_M_SET_I2C_BUS_ERROR_Msk  (0x100UL)             /*!< SCB INTR_M_SET: I2C_BUS_ERROR (Bitfield-Mask: 0x01)       */
#define SCB_INTR_M_SET_SPI_DONE_Pos       (9UL)                 /*!< SCB INTR_M_SET: SPI_DONE (Bit 9)                          */
#define SCB_INTR_M_SET_SPI_DONE_Msk       (0x200UL)             /*!< SCB INTR_M_SET: SPI_DONE (Bitfield-Mask: 0x01)            */
/* ====================================================  SCB.INTR_M_MASK  ==================================================== */
#define SCB_INTR_M_MASK_I2C_ARB_LOST_Pos  (0UL)                 /*!< SCB INTR_M_MASK: I2C_ARB_LOST (Bit 0)                     */
#define SCB_INTR_M_MASK_I2C_ARB_LOST_Msk  (0x1UL)               /*!< SCB INTR_M_MASK: I2C_ARB_LOST (Bitfield-Mask: 0x01)       */
#define SCB_INTR_M_MASK_I2C_NACK_Pos      (1UL)                 /*!< SCB INTR_M_MASK: I2C_NACK (Bit 1)                         */
#define SCB_INTR_M_MASK_I2C_NACK_Msk      (0x2UL)               /*!< SCB INTR_M_MASK: I2C_NACK (Bitfield-Mask: 0x01)           */
#define SCB_INTR_M_MASK_I2C_ACK_Pos       (2UL)                 /*!< SCB INTR_M_MASK: I2C_ACK (Bit 2)                          */
#define SCB_INTR_M_MASK_I2C_ACK_Msk       (0x4UL)               /*!< SCB INTR_M_MASK: I2C_ACK (Bitfield-Mask: 0x01)            */
#define SCB_INTR_M_MASK_I2C_STOP_Pos      (4UL)                 /*!< SCB INTR_M_MASK: I2C_STOP (Bit 4)                         */
#define SCB_INTR_M_MASK_I2C_STOP_Msk      (0x10UL)              /*!< SCB INTR_M_MASK: I2C_STOP (Bitfield-Mask: 0x01)           */
#define SCB_INTR_M_MASK_I2C_BUS_ERROR_Pos (8UL)                 /*!< SCB INTR_M_MASK: I2C_BUS_ERROR (Bit 8)                    */
#define SCB_INTR_M_MASK_I2C_BUS_ERROR_Msk (0x100UL)             /*!< SCB INTR_M_MASK: I2C_BUS_ERROR (Bitfield-Mask: 0x01)      */
