ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_scb.h
#define SCB_INTR_M_MASK_SPI_DONE_Pos      (9UL)                 /*!< SCB INTR_M_MASK: SPI_DONE (Bit 9)                         */
#define SCB_INTR_M_MASK_SPI_DONE_Msk      (0x200UL)             /*!< SCB INTR_M_MASK: SPI_DONE (Bitfield-Mask: 0x01)           */
/* ===================================================  SCB.INTR_M_MASKED  =================================================== */
#define SCB_INTR_M_MASKED_I2C_ARB_LOST_Pos (0UL)                /*!< SCB INTR_M_MASKED: I2C_ARB_LOST (Bit 0)                   */
#define SCB_INTR_M_MASKED_I2C_ARB_LOST_Msk (0x1UL)              /*!< SCB INTR_M_MASKED: I2C_ARB_LOST (Bitfield-Mask: 0x01)     */
#define SCB_INTR_M_MASKED_I2C_NACK_Pos    (1UL)                 /*!< SCB INTR_M_MASKED: I2C_NACK (Bit 1)                       */
#define SCB_INTR_M_MASKED_I2C_NACK_Msk    (0x2UL)               /*!< SCB INTR_M_MASKED: I2C_NACK (Bitfield-Mask: 0x01)         */
#define SCB_INTR_M_MASKED_I2C_ACK_Pos     (2UL)                 /*!< SCB INTR_M_MASKED: I2C_ACK (Bit 2)                        */
#define SCB_INTR_M_MASKED_I2C_ACK_Msk     (0x4UL)               /*!< SCB INTR_M_MASKED: I2C_ACK (Bitfield-Mask: 0x01)          */
#define SCB_INTR_M_MASKED_I2C_STOP_Pos    (4UL)                 /*!< SCB INTR_M_MASKED: I2C_STOP (Bit 4)                       */
#define SCB_INTR_M_MASKED_I2C_STOP_Msk    (0x10UL)              /*!< SCB INTR_M_MASKED: I2C_STOP (Bitfield-Mask: 0x01)         */
#define SCB_INTR_M_MASKED_I2C_BUS_ERROR_Pos (8UL)               /*!< SCB INTR_M_MASKED: I2C_BUS_ERROR (Bit 8)                  */
#define SCB_INTR_M_MASKED_I2C_BUS_ERROR_Msk (0x100UL)           /*!< SCB INTR_M_MASKED: I2C_BUS_ERROR (Bitfield-Mask: 0x01)    */
#define SCB_INTR_M_MASKED_SPI_DONE_Pos    (9UL)                 /*!< SCB INTR_M_MASKED: SPI_DONE (Bit 9)                       */
#define SCB_INTR_M_MASKED_SPI_DONE_Msk    (0x200UL)             /*!< SCB INTR_M_MASKED: SPI_DONE (Bitfield-Mask: 0x01)         */
/* ======================================================  SCB.INTR_S  ======================================================= */
#define SCB_INTR_S_I2C_ARB_LOST_Pos       (0UL)                 /*!< SCB INTR_S: I2C_ARB_LOST (Bit 0)                          */
#define SCB_INTR_S_I2C_ARB_LOST_Msk       (0x1UL)               /*!< SCB INTR_S: I2C_ARB_LOST (Bitfield-Mask: 0x01)            */
#define SCB_INTR_S_I2C_NACK_Pos           (1UL)                 /*!< SCB INTR_S: I2C_NACK (Bit 1)                              */
#define SCB_INTR_S_I2C_NACK_Msk           (0x2UL)               /*!< SCB INTR_S: I2C_NACK (Bitfield-Mask: 0x01)                */
#define SCB_INTR_S_I2C_ACK_Pos            (2UL)                 /*!< SCB INTR_S: I2C_ACK (Bit 2)                               */
#define SCB_INTR_S_I2C_ACK_Msk            (0x4UL)               /*!< SCB INTR_S: I2C_ACK (Bitfield-Mask: 0x01)                 */
#define SCB_INTR_S_I2C_WRITE_STOP_Pos     (3UL)                 /*!< SCB INTR_S: I2C_WRITE_STOP (Bit 3)                        */
#define SCB_INTR_S_I2C_WRITE_STOP_Msk     (0x8UL)               /*!< SCB INTR_S: I2C_WRITE_STOP (Bitfield-Mask: 0x01)          */
#define SCB_INTR_S_I2C_STOP_Pos           (4UL)                 /*!< SCB INTR_S: I2C_STOP (Bit 4)                              */
#define SCB_INTR_S_I2C_STOP_Msk           (0x10UL)              /*!< SCB INTR_S: I2C_STOP (Bitfield-Mask: 0x01)                */
#define SCB_INTR_S_I2C_START_Pos          (5UL)                 /*!< SCB INTR_S: I2C_START (Bit 5)                             */
#define SCB_INTR_S_I2C_START_Msk          (0x20UL)              /*!< SCB INTR_S: I2C_START (Bitfield-Mask: 0x01)               */
#define SCB_INTR_S_I2C_ADDR_MATCH_Pos     (6UL)                 /*!< SCB INTR_S: I2C_ADDR_MATCH (Bit 6)                        */
#define SCB_INTR_S_I2C_ADDR_MATCH_Msk     (0x40UL)              /*!< SCB INTR_S: I2C_ADDR_MATCH (Bitfield-Mask: 0x01)          */
#define SCB_INTR_S_I2C_GENERAL_Pos        (7UL)                 /*!< SCB INTR_S: I2C_GENERAL (Bit 7)                           */
#define SCB_INTR_S_I2C_GENERAL_Msk        (0x80UL)              /*!< SCB INTR_S: I2C_GENERAL (Bitfield-Mask: 0x01)             */
#define SCB_INTR_S_I2C_BUS_ERROR_Pos      (8UL)                 /*!< SCB INTR_S: I2C_BUS_ERROR (Bit 8)                         */
#define SCB_INTR_S_I2C_BUS_ERROR_Msk      (0x100UL)             /*!< SCB INTR_S: I2C_BUS_ERROR (Bitfield-Mask: 0x01)           */
#define SCB_INTR_S_SPI_EZ_WRITE_STOP_Pos  (9UL)                 /*!< SCB INTR_S: SPI_EZ_WRITE_STOP (Bit 9)                     */
#define SCB_INTR_S_SPI_EZ_WRITE_STOP_Msk  (0x200UL)             /*!< SCB INTR_S: SPI_EZ_WRITE_STOP (Bitfield-Mask: 0x01)       */
#define SCB_INTR_S_SPI_EZ_STOP_Pos        (10UL)                /*!< SCB INTR_S: SPI_EZ_STOP (Bit 10)                          */
#define SCB_INTR_S_SPI_EZ_STOP_Msk        (0x400UL)             /*!< SCB INTR_S: SPI_EZ_STOP (Bitfield-Mask: 0x01)             */
#define SCB_INTR_S_SPI_BUS_ERROR_Pos      (11UL)                /*!< SCB INTR_S: SPI_BUS_ERROR (Bit 11)                        */
#define SCB_INTR_S_SPI_BUS_ERROR_Msk      (0x800UL)             /*!< SCB INTR_S: SPI_BUS_ERROR (Bitfield-Mask: 0x01)           */
/* ====================================================  SCB.INTR_S_SET  ===================================================== */
#define SCB_INTR_S_SET_I2C_ARB_LOST_Pos   (0UL)                 /*!< SCB INTR_S_SET: I2C_ARB_LOST (Bit 0)                      */
#define SCB_INTR_S_SET_I2C_ARB_LOST_Msk   (0x1UL)               /*!< SCB INTR_S_SET: I2C_ARB_LOST (Bitfield-Mask: 0x01)        */
#define SCB_INTR_S_SET_I2C_NACK_Pos       (1UL)                 /*!< SCB INTR_S_SET: I2C_NACK (Bit 1)                          */
#define SCB_INTR_S_SET_I2C_NACK_Msk       (0x2UL)               /*!< SCB INTR_S_SET: I2C_NACK (Bitfield-Mask: 0x01)            */
#define SCB_INTR_S_SET_I2C_ACK_Pos        (2UL)                 /*!< SCB INTR_S_SET: I2C_ACK (Bit 2)                           */
#define SCB_INTR_S_SET_I2C_ACK_Msk        (0x4UL)               /*!< SCB INTR_S_SET: I2C_ACK (Bitfield-Mask: 0x01)             */
#define SCB_INTR_S_SET_I2C_WRITE_STOP_Pos (3UL)                 /*!< SCB INTR_S_SET: I2C_WRITE_STOP (Bit 3)                    */
#define SCB_INTR_S_SET_I2C_WRITE_STOP_Msk (0x8UL)               /*!< SCB INTR_S_SET: I2C_WRITE_STOP (Bitfield-Mask: 0x01)      */
#define SCB_INTR_S_SET_I2C_STOP_Pos       (4UL)                 /*!< SCB INTR_S_SET: I2C_STOP (Bit 4)                          */
#define SCB_INTR_S_SET_I2C_STOP_Msk       (0x10UL)              /*!< SCB INTR_S_SET: I2C_STOP (Bitfield-Mask: 0x01)            */
#define SCB_INTR_S_SET_I2C_START_Pos      (5UL)                 /*!< SCB INTR_S_SET: I2C_START (Bit 5)                         */
#define SCB_INTR_S_SET_I2C_START_Msk      (0x20UL)              /*!< SCB INTR_S_SET: I2C_START (Bitfield-Mask: 0x01)           */
#define SCB_INTR_S_SET_I2C_ADDR_MATCH_Pos (6UL)                 /*!< SCB INTR_S_SET: I2C_ADDR_MATCH (Bit 6)                    */
#define SCB_INTR_S_SET_I2C_ADDR_MATCH_Msk (0x40UL)              /*!< SCB INTR_S_SET: I2C_ADDR_MATCH (Bitfield-Mask: 0x01)      */
#define SCB_INTR_S_SET_I2C_GENERAL_Pos    (7UL)                 /*!< SCB INTR_S_SET: I2C_GENERAL (Bit 7)                       */
#define SCB_INTR_S_SET_I2C_GENERAL_Msk    (0x80UL)              /*!< SCB INTR_S_SET: I2C_GENERAL (Bitfield-Mask: 0x01)         */
#define SCB_INTR_S_SET_I2C_BUS_ERROR_Pos  (8UL)                 /*!< SCB INTR_S_SET: I2C_BUS_ERROR (Bit 8)                     */
#define SCB_INTR_S_SET_I2C_BUS_ERROR_Msk  (0x100UL)             /*!< SCB INTR_S_SET: I2C_BUS_ERROR (Bitfield-Mask: 0x01)       */
#define SCB_INTR_S_SET_SPI_EZ_WRITE_STOP_Pos (9UL)              /*!< SCB INTR_S_SET: SPI_EZ_WRITE_STOP (Bit 9)                 */
#define SCB_INTR_S_SET_SPI_EZ_WRITE_STOP_Msk (0x200UL)          /*!< SCB INTR_S_SET: SPI_EZ_WRITE_STOP (Bitfield-Mask: 0x01)   */
#define SCB_INTR_S_SET_SPI_EZ_STOP_Pos    (10UL)                /*!< SCB INTR_S_SET: SPI_EZ_STOP (Bit 10)                      */
#define SCB_INTR_S_SET_SPI_EZ_STOP_Msk    (0x400UL)             /*!< SCB INTR_S_SET: SPI_EZ_STOP (Bitfield-Mask: 0x01)         */
#define SCB_INTR_S_SET_SPI_BUS_ERROR_Pos  (11UL)                /*!< SCB INTR_S_SET: SPI_BUS_ERROR (Bit 11)                    */
#define SCB_INTR_S_SET_SPI_BUS_ERROR_Msk  (0x800UL)             /*!< SCB INTR_S_SET: SPI_BUS_ERROR (Bitfield-Mask: 0x01)       */
/* ====================================================  SCB.INTR_S_MASK  ==================================================== */
#define SCB_INTR_S_MASK_I2C_ARB_LOST_Pos  (0UL)                 /*!< SCB INTR_S_MASK: I2C_ARB_LOST (Bit 0)                     */
#define SCB_INTR_S_MASK_I2C_ARB_LOST_Msk  (0x1UL)               /*!< SCB INTR_S_MASK: I2C_ARB_LOST (Bitfield-Mask: 0x01)       */
#define SCB_INTR_S_MASK_I2C_NACK_Pos      (1UL)                 /*!< SCB INTR_S_MASK: I2C_NACK (Bit 1)                         */
#define SCB_INTR_S_MASK_I2C_NACK_Msk      (0x2UL)               /*!< SCB INTR_S_MASK: I2C_NACK (Bitfield-Mask: 0x01)           */
#define SCB_INTR_S_MASK_I2C_ACK_Pos       (2UL)                 /*!< SCB INTR_S_MASK: I2C_ACK (Bit 2)                          */
#define SCB_INTR_S_MASK_I2C_ACK_Msk       (0x4UL)               /*!< SCB INTR_S_MASK: I2C_ACK (Bitfield-Mask: 0x01)            */
#define SCB_INTR_S_MASK_I2C_WRITE_STOP_Pos (3UL)                /*!< SCB INTR_S_MASK: I2C_WRITE_STOP (Bit 3)                   */
#define SCB_INTR_S_MASK_I2C_WRITE_STOP_Msk (0x8UL)              /*!< SCB INTR_S_MASK: I2C_WRITE_STOP (Bitfield-Mask: 0x01)     */
#define SCB_INTR_S_MASK_I2C_STOP_Pos      (4UL)                 /*!< SCB INTR_S_MASK: I2C_STOP (Bit 4)                         */
#define SCB_INTR_S_MASK_I2C_STOP_Msk      (0x10UL)              /*!< SCB INTR_S_MASK: I2C_STOP (Bitfield-Mask: 0x01)           */
#define SCB_INTR_S_MASK_I2C_START_Pos     (5UL)                 /*!< SCB INTR_S_MASK: I2C_START (Bit 5)                        */
#define SCB_INTR_S_MASK_I2C_START_Msk     (0x20UL)              /*!< SCB INTR_S_MASK: I2C_START (Bitfield-Mask: 0x01)          */
#define SCB_INTR_S_MASK_I2C_ADDR_MATCH_Pos (6UL)                /*!< SCB INTR_S_MASK: I2C_ADDR_MATCH (Bit 6)                   */
#define SCB_INTR_S_MASK_I2C_ADDR_MATCH_Msk (0x40UL)             /*!< SCB INTR_S_MASK: I2C_ADDR_MATCH (Bitfield-Mask: 0x01)     */
#define SCB_INTR_S_MASK_I2C_GENERAL_Pos   (7UL)                 /*!< SCB INTR_S_MASK: I2C_GENERAL (Bit 7)                      */
#define SCB_INTR_S_MASK_I2C_GENERAL_Msk   (0x80UL)              /*!< SCB INTR_S_MASK: I2C_GENERAL (Bitfield-Mask: 0x01)        */
#define SCB_INTR_S_MASK_I2C_BUS_ERROR_Pos (8UL)                 /*!< SCB INTR_S_MASK: I2C_BUS_ERROR (Bit 8)                    */
#define SCB_INTR_S_MASK_I2C_BUS_ERROR_Msk (0x100UL)             /*!< SCB INTR_S_MASK: I2C_BUS_ERROR (Bitfield-Mask: 0x01)      */
#define SCB_INTR_S_MASK_SPI_EZ_WRITE_STOP_Pos (9UL)             /*!< SCB INTR_S_MASK: SPI_EZ_WRITE_STOP (Bit 9)                */
#define SCB_INTR_S_MASK_SPI_EZ_WRITE_STOP_Msk (0x200UL)         /*!< SCB INTR_S_MASK: SPI_EZ_WRITE_STOP (Bitfield-Mask: 0x01)  */
#define SCB_INTR_S_MASK_SPI_EZ_STOP_Pos   (10UL)                /*!< SCB INTR_S_MASK: SPI_EZ_STOP (Bit 10)                     */
#define SCB_INTR_S_MASK_SPI_EZ_STOP_Msk   (0x400UL)             /*!< SCB INTR_S_MASK: SPI_EZ_STOP (Bitfield-Mask: 0x01)        */
#define SCB_INTR_S_MASK_SPI_BUS_ERROR_Pos (11UL)                /*!< SCB INTR_S_MASK: SPI_BUS_ERROR (Bit 11)                   */
#define SCB_INTR_S_MASK_SPI_BUS_ERROR_Msk (0x800UL)             /*!< SCB INTR_S_MASK: SPI_BUS_ERROR (Bitfield-Mask: 0x01)      */
/* ===================================================  SCB.INTR_S_MASKED  =================================================== */
#define SCB_INTR_S_MASKED_I2C_ARB_LOST_Pos (0UL)                /*!< SCB INTR_S_MASKED: I2C_ARB_LOST (Bit 0)                   */
#define SCB_INTR_S_MASKED_I2C_ARB_LOST_Msk (0x1UL)              /*!< SCB INTR_S_MASKED: I2C_ARB_LOST (Bitfield-Mask: 0x01)     */
#define SCB_INTR_S_MASKED_I2C_NACK_Pos    (1UL)                 /*!< SCB INTR_S_MASKED: I2C_NACK (Bit 1)                       */
#define SCB_INTR_S_MASKED_I2C_NACK_Msk    (0x2UL)               /*!< SCB INTR_S_MASKED: I2C_NACK (Bitfield-Mask: 0x01)         */
#define SCB_INTR_S_MASKED_I2C_ACK_Pos     (2UL)                 /*!< SCB INTR_S_MASKED: I2C_ACK (Bit 2)                        */
#define SCB_INTR_S_MASKED_I2C_ACK_Msk     (0x4UL)               /*!< SCB INTR_S_MASKED: I2C_ACK (Bitfield-Mask: 0x01)          */
#define SCB_INTR_S_MASKED_I2C_WRITE_STOP_Pos (3UL)              /*!< SCB INTR_S_MASKED: I2C_WRITE_STOP (Bit 3)                 */
#define SCB_INTR_S_MASKED_I2C_WRITE_STOP_Msk (0x8UL)            /*!< SCB INTR_S_MASKED: I2C_WRITE_STOP (Bitfield-Mask: 0x01)   */
#define SCB_INTR_S_MASKED_I2C_STOP_Pos    (4UL)                 /*!< SCB INTR_S_MASKED: I2C_STOP (Bit 4)                       */
#define SCB_INTR_S_MASKED_I2C_STOP_Msk    (0x10UL)              /*!< SCB INTR_S_MASKED: I2C_STOP (Bitfield-Mask: 0x01)         */
#define SCB_INTR_S_MASKED_I2C_START_Pos   (5UL)                 /*!< SCB INTR_S_MASKED: I2C_START (Bit 5)                      */
#define SCB_INTR_S_MASKED_I2C_START_Msk   (0x20UL)              /*!< SCB INTR_S_MASKED: I2C_START (Bitfield-Mask: 0x01)        */
#define SCB_INTR_S_MASKED_I2C_ADDR_MATCH_Pos (6UL)              /*!< SCB INTR_S_MASKED: I2C_ADDR_MATCH (Bit 6)                 */
#define SCB_INTR_S_MASKED_I2C_ADDR_MATCH_Msk (0x40UL)           /*!< SCB INTR_S_MASKED: I2C_ADDR_MATCH (Bitfield-Mask: 0x01)   */
#define SCB_INTR_S_MASKED_I2C_GENERAL_Pos (7UL)                 /*!< SCB INTR_S_MASKED: I2C_GENERAL (Bit 7)                    */
#define SCB_INTR_S_MASKED_I2C_GENERAL_Msk (0x80UL)              /*!< SCB INTR_S_MASKED: I2C_GENERAL (Bitfield-Mask: 0x01)      */
#define SCB_INTR_S_MASKED_I2C_BUS_ERROR_Pos (8UL)               /*!< SCB INTR_S_MASKED: I2C_BUS_ERROR (Bit 8)                  */
#define SCB_INTR_S_MASKED_I2C_BUS_ERROR_Msk (0x100UL)           /*!< SCB INTR_S_MASKED: I2C_BUS_ERROR (Bitfield-Mask: 0x01)    */
#define SCB_INTR_S_MASKED_SPI_EZ_WRITE_STOP_Pos (9UL)           /*!< SCB INTR_S_MASKED: SPI_EZ_WRITE_STOP (Bit 9)              */
#define SCB_INTR_S_MASKED_SPI_EZ_WRITE_STOP_Msk (0x200UL)       /*!< SCB INTR_S_MASKED: SPI_EZ_WRITE_STOP (Bitfield-Mask: 0x01)*/
#define SCB_INTR_S_MASKED_SPI_EZ_STOP_Pos (10UL)                /*!< SCB INTR_S_MASKED: SPI_EZ_STOP (Bit 10)                   */
#define SCB_INTR_S_MASKED_SPI_EZ_STOP_Msk (0x400UL)             /*!< SCB INTR_S_MASKED: SPI_EZ_STOP (Bitfield-Mask: 0x01)      */
#define SCB_INTR_S_MASKED_SPI_BUS_ERROR_Pos (11UL)              /*!< SCB INTR_S_MASKED: SPI_BUS_ERROR (Bit 11)                 */
#define SCB_INTR_S_MASKED_SPI_BUS_ERROR_Msk (0x800UL)           /*!< SCB INTR_S_MASKED: SPI_BUS_ERROR (Bitfield-Mask: 0x01)    */
/* ======================================================  SCB.INTR_TX  ====================================================== */
#define SCB_INTR_TX_TRIGGER_Pos           (0UL)                 /*!< SCB INTR_TX: TRIGGER (Bit 0)                              */
#define SCB_INTR_TX_TRIGGER_Msk           (0x1UL)               /*!< SCB INTR_TX: TRIGGER (Bitfield-Mask: 0x01)                */
#define SCB_INTR_TX_NOT_FULL_Pos          (1UL)                 /*!< SCB INTR_TX: NOT_FULL (Bit 1)                             */
#define SCB_INTR_TX_NOT_FULL_Msk          (0x2UL)               /*!< SCB INTR_TX: NOT_FULL (Bitfield-Mask: 0x01)               */
#define SCB_INTR_TX_EMPTY_Pos             (4UL)                 /*!< SCB INTR_TX: EMPTY (Bit 4)                                */
#define SCB_INTR_TX_EMPTY_Msk             (0x10UL)              /*!< SCB INTR_TX: EMPTY (Bitfield-Mask: 0x01)                  */
#define SCB_INTR_TX_OVERFLOW_Pos          (5UL)                 /*!< SCB INTR_TX: OVERFLOW (Bit 5)                             */
#define SCB_INTR_TX_OVERFLOW_Msk          (0x20UL)              /*!< SCB INTR_TX: OVERFLOW (Bitfield-Mask: 0x01)               */
#define SCB_INTR_TX_UNDERFLOW_Pos         (6UL)                 /*!< SCB INTR_TX: UNDERFLOW (Bit 6)                            */
#define SCB_INTR_TX_UNDERFLOW_Msk         (0x40UL)              /*!< SCB INTR_TX: UNDERFLOW (Bitfield-Mask: 0x01)              */
#define SCB_INTR_TX_BLOCKED_Pos           (7UL)                 /*!< SCB INTR_TX: BLOCKED (Bit 7)                              */
#define SCB_INTR_TX_BLOCKED_Msk           (0x80UL)              /*!< SCB INTR_TX: BLOCKED (Bitfield-Mask: 0x01)                */
#define SCB_INTR_TX_UART_NACK_Pos         (8UL)                 /*!< SCB INTR_TX: UART_NACK (Bit 8)                            */
#define SCB_INTR_TX_UART_NACK_Msk         (0x100UL)             /*!< SCB INTR_TX: UART_NACK (Bitfield-Mask: 0x01)              */
#define SCB_INTR_TX_UART_DONE_Pos         (9UL)                 /*!< SCB INTR_TX: UART_DONE (Bit 9)                            */
#define SCB_INTR_TX_UART_DONE_Msk         (0x200UL)             /*!< SCB INTR_TX: UART_DONE (Bitfield-Mask: 0x01)              */
#define SCB_INTR_TX_UART_ARB_LOST_Pos     (10UL)                /*!< SCB INTR_TX: UART_ARB_LOST (Bit 10)                       */
#define SCB_INTR_TX_UART_ARB_LOST_Msk     (0x400UL)             /*!< SCB INTR_TX: UART_ARB_LOST (Bitfield-Mask: 0x01)          */
/* ====================================================  SCB.INTR_TX_SET  ==================================================== */
#define SCB_INTR_TX_SET_TRIGGER_Pos       (0UL)                 /*!< SCB INTR_TX_SET: TRIGGER (Bit 0)                          */
#define SCB_INTR_TX_SET_TRIGGER_Msk       (0x1UL)               /*!< SCB INTR_TX_SET: TRIGGER (Bitfield-Mask: 0x01)            */
#define SCB_INTR_TX_SET_NOT_FULL_Pos      (1UL)                 /*!< SCB INTR_TX_SET: NOT_FULL (Bit 1)                         */
#define SCB_INTR_TX_SET_NOT_FULL_Msk      (0x2UL)               /*!< SCB INTR_TX_SET: NOT_FULL (Bitfield-Mask: 0x01)           */
#define SCB_INTR_TX_SET_EMPTY_Pos         (4UL)                 /*!< SCB INTR_TX_SET: EMPTY (Bit 4)                            */
#define SCB_INTR_TX_SET_EMPTY_Msk         (0x10UL)              /*!< SCB INTR_TX_SET: EMPTY (Bitfield-Mask: 0x01)              */
#define SCB_INTR_TX_SET_OVERFLOW_Pos      (5UL)                 /*!< SCB INTR_TX_SET: OVERFLOW (Bit 5)                         */
#define SCB_INTR_TX_SET_OVERFLOW_Msk      (0x20UL)              /*!< SCB INTR_TX_SET: OVERFLOW (Bitfield-Mask: 0x01)           */
#define SCB_INTR_TX_SET_UNDERFLOW_Pos     (6UL)                 /*!< SCB INTR_TX_SET: UNDERFLOW (Bit 6)                        */
#define SCB_INTR_TX_SET_UNDERFLOW_Msk     (0x40UL)              /*!< SCB INTR_TX_SET: UNDERFLOW (Bitfield-Mask: 0x01)          */
#define SCB_INTR_TX_SET_BLOCKED_Pos       (7UL)                 /*!< SCB INTR_TX_SET: BLOCKED (Bit 7)                          */
#define SCB_INTR_TX_SET_BLOCKED_Msk       (0x80UL)              /*!< SCB INTR_TX_SET: BLOCKED (Bitfield-Mask: 0x01)            */
#define SCB_INTR_TX_SET_UART_NACK_Pos     (8UL)                 /*!< SCB INTR_TX_SET: UART_NACK (Bit 8)                        */
#define SCB_INTR_TX_SET_UART_NACK_Msk     (0x100UL)             /*!< SCB INTR_TX_SET: UART_NACK (Bitfield-Mask: 0x01)          */
#define SCB_INTR_TX_SET_UART_DONE_Pos     (9UL)                 /*!< SCB INTR_TX_SET: UART_DONE (Bit 9)                        */
#define SCB_INTR_TX_SET_UART_DONE_Msk     (0x200UL)             /*!< SCB INTR_TX_SET: UART_DONE (Bitfield-Mask: 0x01)          */
#define SCB_INTR_TX_SET_UART_ARB_LOST_Pos (10UL)                /*!< SCB INTR_TX_SET: UART_ARB_LOST (Bit 10)                   */
#define SCB_INTR_TX_SET_UART_ARB_LOST_Msk (0x400UL)             /*!< SCB INTR_TX_SET: UART_ARB_LOST (Bitfield-Mask: 0x01)      */
/* ===================================================  SCB.INTR_TX_MASK  ==================================================== */
#define SCB_INTR_TX_MASK_TRIGGER_Pos      (0UL)                 /*!< SCB INTR_TX_MASK: TRIGGER (Bit 0)                         */
#define SCB_INTR_TX_MASK_TRIGGER_Msk      (0x1UL)               /*!< SCB INTR_TX_MASK: TRIGGER (Bitfield-Mask: 0x01)           */
#define SCB_INTR_TX_MASK_NOT_FULL_Pos     (1UL)                 /*!< SCB INTR_TX_MASK: NOT_FULL (Bit 1)                        */
#define SCB_INTR_TX_MASK_NOT_FULL_Msk     (0x2UL)               /*!< SCB INTR_TX_MASK: NOT_FULL (Bitfield-Mask: 0x01)          */
#define SCB_INTR_TX_MASK_EMPTY_Pos        (4UL)                 /*!< SCB INTR_TX_MASK: EMPTY (Bit 4)                           */
#define SCB_INTR_TX_MASK_EMPTY_Msk        (0x10UL)              /*!< SCB INTR_TX_MASK: EMPTY (Bitfield-Mask: 0x01)             */
#define SCB_INTR_TX_MASK_OVERFLOW_Pos     (5UL)                 /*!< SCB INTR_TX_MASK: OVERFLOW (Bit 5)                        */
#define SCB_INTR_TX_MASK_OVERFLOW_Msk     (0x20UL)              /*!< SCB INTR_TX_MASK: OVERFLOW (Bitfield-Mask: 0x01)          */
#define SCB_INTR_TX_MASK_UNDERFLOW_Pos    (6UL)                 /*!< SCB INTR_TX_MASK: UNDERFLOW (Bit 6)                       */
#define SCB_INTR_TX_MASK_UNDERFLOW_Msk    (0x40UL)              /*!< SCB INTR_TX_MASK: UNDERFLOW (Bitfield-Mask: 0x01)         */
#define SCB_INTR_TX_MASK_BLOCKED_Pos      (7UL)                 /*!< SCB INTR_TX_MASK: BLOCKED (Bit 7)                         */
#define SCB_INTR_TX_MASK_BLOCKED_Msk      (0x80UL)              /*!< SCB INTR_TX_MASK: BLOCKED (Bitfield-Mask: 0x01)           */
#define SCB_INTR_TX_MASK_UART_NACK_Pos    (8UL)                 /*!< SCB INTR_TX_MASK: UART_NACK (Bit 8)                       */
#define SCB_INTR_TX_MASK_UART_NACK_Msk    (0x100UL)             /*!< SCB INTR_TX_MASK: UART_NACK (Bitfield-Mask: 0x01)         */
#define SCB_INTR_TX_MASK_UART_DONE_Pos    (9UL)                 /*!< SCB INTR_TX_MASK: UART_DONE (Bit 9)                       */
#define SCB_INTR_TX_MASK_UART_DONE_Msk    (0x200UL)             /*!< SCB INTR_TX_MASK: UART_DONE (Bitfield-Mask: 0x01)         */
#define SCB_INTR_TX_MASK_UART_ARB_LOST_Pos (10UL)               /*!< SCB INTR_TX_MASK: UART_ARB_LOST (Bit 10)                  */
#define SCB_INTR_TX_MASK_UART_ARB_LOST_Msk (0x400UL)            /*!< SCB INTR_TX_MASK: UART_ARB_LOST (Bitfield-Mask: 0x01)     */
/* ==================================================  SCB.INTR_TX_MASKED  =================================================== */
#define SCB_INTR_TX_MASKED_TRIGGER_Pos    (0UL)                 /*!< SCB INTR_TX_MASKED: TRIGGER (Bit 0)                       */
#define SCB_INTR_TX_MASKED_TRIGGER_Msk    (0x1UL)               /*!< SCB INTR_TX_MASKED: TRIGGER (Bitfield-Mask: 0x01)         */
#define SCB_INTR_TX_MASKED_NOT_FULL_Pos   (1UL)                 /*!< SCB INTR_TX_MASKED: NOT_FULL (Bit 1)                      */
#define SCB_INTR_TX_MASKED_NOT_FULL_Msk   (0x2UL)               /*!< SCB INTR_TX_MASKED: NOT_FULL (Bitfield-Mask: 0x01)        */
#define SCB_INTR_TX_MASKED_EMPTY_Pos      (4UL)                 /*!< SCB INTR_TX_MASKED: EMPTY (Bit 4)                         */
#define SCB_INTR_TX_MASKED_EMPTY_Msk      (0x10UL)              /*!< SCB INTR_TX_MASKED: EMPTY (Bitfield-Mask: 0x01)           */
#define SCB_INTR_TX_MASKED_OVERFLOW_Pos   (5UL)                 /*!< SCB INTR_TX_MASKED: OVERFLOW (Bit 5)                      */
#define SCB_INTR_TX_MASKED_OVERFLOW_Msk   (0x20UL)              /*!< SCB INTR_TX_MASKED: OVERFLOW (Bitfield-Mask: 0x01)        */
#define SCB_INTR_TX_MASKED_UNDERFLOW_Pos  (6UL)                 /*!< SCB INTR_TX_MASKED: UNDERFLOW (Bit 6)                     */
#define SCB_INTR_TX_MASKED_UNDERFLOW_Msk  (0x40UL)              /*!< SCB INTR_TX_MASKED: UNDERFLOW (Bitfield-Mask: 0x01)       */
#define SCB_INTR_TX_MASKED_BLOCKED_Pos    (7UL)                 /*!< SCB INTR_TX_MASKED: BLOCKED (Bit 7)                       */
