ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_scb.h
#define SCB_INTR_TX_MASKED_BLOCKED_Msk    (0x80UL)              /*!< SCB INTR_TX_MASKED: BLOCKED (Bitfield-Mask: 0x01)         */
#define SCB_INTR_TX_MASKED_UART_NACK_Pos  (8UL)                 /*!< SCB INTR_TX_MASKED: UART_NACK (Bit 8)                     */
#define SCB_INTR_TX_MASKED_UART_NACK_Msk  (0x100UL)             /*!< SCB INTR_TX_MASKED: UART_NACK (Bitfield-Mask: 0x01)       */
#define SCB_INTR_TX_MASKED_UART_DONE_Pos  (9UL)                 /*!< SCB INTR_TX_MASKED: UART_DONE (Bit 9)                     */
#define SCB_INTR_TX_MASKED_UART_DONE_Msk  (0x200UL)             /*!< SCB INTR_TX_MASKED: UART_DONE (Bitfield-Mask: 0x01)       */
#define SCB_INTR_TX_MASKED_UART_ARB_LOST_Pos (10UL)             /*!< SCB INTR_TX_MASKED: UART_ARB_LOST (Bit 10)                */
#define SCB_INTR_TX_MASKED_UART_ARB_LOST_Msk (0x400UL)          /*!< SCB INTR_TX_MASKED: UART_ARB_LOST (Bitfield-Mask: 0x01)   */
/* ======================================================  SCB.INTR_RX  ====================================================== */
#define SCB_INTR_RX_TRIGGER_Pos           (0UL)                 /*!< SCB INTR_RX: TRIGGER (Bit 0)                              */
#define SCB_INTR_RX_TRIGGER_Msk           (0x1UL)               /*!< SCB INTR_RX: TRIGGER (Bitfield-Mask: 0x01)                */
#define SCB_INTR_RX_NOT_EMPTY_Pos         (2UL)                 /*!< SCB INTR_RX: NOT_EMPTY (Bit 2)                            */
#define SCB_INTR_RX_NOT_EMPTY_Msk         (0x4UL)               /*!< SCB INTR_RX: NOT_EMPTY (Bitfield-Mask: 0x01)              */
#define SCB_INTR_RX_FULL_Pos              (3UL)                 /*!< SCB INTR_RX: FULL (Bit 3)                                 */
#define SCB_INTR_RX_FULL_Msk              (0x8UL)               /*!< SCB INTR_RX: FULL (Bitfield-Mask: 0x01)                   */
#define SCB_INTR_RX_OVERFLOW_Pos          (5UL)                 /*!< SCB INTR_RX: OVERFLOW (Bit 5)                             */
#define SCB_INTR_RX_OVERFLOW_Msk          (0x20UL)              /*!< SCB INTR_RX: OVERFLOW (Bitfield-Mask: 0x01)               */
#define SCB_INTR_RX_UNDERFLOW_Pos         (6UL)                 /*!< SCB INTR_RX: UNDERFLOW (Bit 6)                            */
#define SCB_INTR_RX_UNDERFLOW_Msk         (0x40UL)              /*!< SCB INTR_RX: UNDERFLOW (Bitfield-Mask: 0x01)              */
#define SCB_INTR_RX_BLOCKED_Pos           (7UL)                 /*!< SCB INTR_RX: BLOCKED (Bit 7)                              */
#define SCB_INTR_RX_BLOCKED_Msk           (0x80UL)              /*!< SCB INTR_RX: BLOCKED (Bitfield-Mask: 0x01)                */
#define SCB_INTR_RX_FRAME_ERROR_Pos       (8UL)                 /*!< SCB INTR_RX: FRAME_ERROR (Bit 8)                          */
#define SCB_INTR_RX_FRAME_ERROR_Msk       (0x100UL)             /*!< SCB INTR_RX: FRAME_ERROR (Bitfield-Mask: 0x01)            */
#define SCB_INTR_RX_PARITY_ERROR_Pos      (9UL)                 /*!< SCB INTR_RX: PARITY_ERROR (Bit 9)                         */
#define SCB_INTR_RX_PARITY_ERROR_Msk      (0x200UL)             /*!< SCB INTR_RX: PARITY_ERROR (Bitfield-Mask: 0x01)           */
#define SCB_INTR_RX_BAUD_DETECT_Pos       (10UL)                /*!< SCB INTR_RX: BAUD_DETECT (Bit 10)                         */
#define SCB_INTR_RX_BAUD_DETECT_Msk       (0x400UL)             /*!< SCB INTR_RX: BAUD_DETECT (Bitfield-Mask: 0x01)            */
#define SCB_INTR_RX_BREAK_DETECT_Pos      (11UL)                /*!< SCB INTR_RX: BREAK_DETECT (Bit 11)                        */
#define SCB_INTR_RX_BREAK_DETECT_Msk      (0x800UL)             /*!< SCB INTR_RX: BREAK_DETECT (Bitfield-Mask: 0x01)           */
/* ====================================================  SCB.INTR_RX_SET  ==================================================== */
#define SCB_INTR_RX_SET_TRIGGER_Pos       (0UL)                 /*!< SCB INTR_RX_SET: TRIGGER (Bit 0)                          */
#define SCB_INTR_RX_SET_TRIGGER_Msk       (0x1UL)               /*!< SCB INTR_RX_SET: TRIGGER (Bitfield-Mask: 0x01)            */
#define SCB_INTR_RX_SET_NOT_EMPTY_Pos     (2UL)                 /*!< SCB INTR_RX_SET: NOT_EMPTY (Bit 2)                        */
#define SCB_INTR_RX_SET_NOT_EMPTY_Msk     (0x4UL)               /*!< SCB INTR_RX_SET: NOT_EMPTY (Bitfield-Mask: 0x01)          */
#define SCB_INTR_RX_SET_FULL_Pos          (3UL)                 /*!< SCB INTR_RX_SET: FULL (Bit 3)                             */
#define SCB_INTR_RX_SET_FULL_Msk          (0x8UL)               /*!< SCB INTR_RX_SET: FULL (Bitfield-Mask: 0x01)               */
#define SCB_INTR_RX_SET_OVERFLOW_Pos      (5UL)                 /*!< SCB INTR_RX_SET: OVERFLOW (Bit 5)                         */
#define SCB_INTR_RX_SET_OVERFLOW_Msk      (0x20UL)              /*!< SCB INTR_RX_SET: OVERFLOW (Bitfield-Mask: 0x01)           */
#define SCB_INTR_RX_SET_UNDERFLOW_Pos     (6UL)                 /*!< SCB INTR_RX_SET: UNDERFLOW (Bit 6)                        */
#define SCB_INTR_RX_SET_UNDERFLOW_Msk     (0x40UL)              /*!< SCB INTR_RX_SET: UNDERFLOW (Bitfield-Mask: 0x01)          */
#define SCB_INTR_RX_SET_BLOCKED_Pos       (7UL)                 /*!< SCB INTR_RX_SET: BLOCKED (Bit 7)                          */
#define SCB_INTR_RX_SET_BLOCKED_Msk       (0x80UL)              /*!< SCB INTR_RX_SET: BLOCKED (Bitfield-Mask: 0x01)            */
#define SCB_INTR_RX_SET_FRAME_ERROR_Pos   (8UL)                 /*!< SCB INTR_RX_SET: FRAME_ERROR (Bit 8)                      */
#define SCB_INTR_RX_SET_FRAME_ERROR_Msk   (0x100UL)             /*!< SCB INTR_RX_SET: FRAME_ERROR (Bitfield-Mask: 0x01)        */
#define SCB_INTR_RX_SET_PARITY_ERROR_Pos  (9UL)                 /*!< SCB INTR_RX_SET: PARITY_ERROR (Bit 9)                     */
#define SCB_INTR_RX_SET_PARITY_ERROR_Msk  (0x200UL)             /*!< SCB INTR_RX_SET: PARITY_ERROR (Bitfield-Mask: 0x01)       */
#define SCB_INTR_RX_SET_BAUD_DETECT_Pos   (10UL)                /*!< SCB INTR_RX_SET: BAUD_DETECT (Bit 10)                     */
#define SCB_INTR_RX_SET_BAUD_DETECT_Msk   (0x400UL)             /*!< SCB INTR_RX_SET: BAUD_DETECT (Bitfield-Mask: 0x01)        */
#define SCB_INTR_RX_SET_BREAK_DETECT_Pos  (11UL)                /*!< SCB INTR_RX_SET: BREAK_DETECT (Bit 11)                    */
#define SCB_INTR_RX_SET_BREAK_DETECT_Msk  (0x800UL)             /*!< SCB INTR_RX_SET: BREAK_DETECT (Bitfield-Mask: 0x01)       */
/* ===================================================  SCB.INTR_RX_MASK  ==================================================== */
#define SCB_INTR_RX_MASK_TRIGGER_Pos      (0UL)                 /*!< SCB INTR_RX_MASK: TRIGGER (Bit 0)                         */
#define SCB_INTR_RX_MASK_TRIGGER_Msk      (0x1UL)               /*!< SCB INTR_RX_MASK: TRIGGER (Bitfield-Mask: 0x01)           */
#define SCB_INTR_RX_MASK_NOT_EMPTY_Pos    (2UL)                 /*!< SCB INTR_RX_MASK: NOT_EMPTY (Bit 2)                       */
#define SCB_INTR_RX_MASK_NOT_EMPTY_Msk    (0x4UL)               /*!< SCB INTR_RX_MASK: NOT_EMPTY (Bitfield-Mask: 0x01)         */
#define SCB_INTR_RX_MASK_FULL_Pos         (3UL)                 /*!< SCB INTR_RX_MASK: FULL (Bit 3)                            */
#define SCB_INTR_RX_MASK_FULL_Msk         (0x8UL)               /*!< SCB INTR_RX_MASK: FULL (Bitfield-Mask: 0x01)              */
#define SCB_INTR_RX_MASK_OVERFLOW_Pos     (5UL)                 /*!< SCB INTR_RX_MASK: OVERFLOW (Bit 5)                        */
#define SCB_INTR_RX_MASK_OVERFLOW_Msk     (0x20UL)              /*!< SCB INTR_RX_MASK: OVERFLOW (Bitfield-Mask: 0x01)          */
#define SCB_INTR_RX_MASK_UNDERFLOW_Pos    (6UL)                 /*!< SCB INTR_RX_MASK: UNDERFLOW (Bit 6)                       */
#define SCB_INTR_RX_MASK_UNDERFLOW_Msk    (0x40UL)              /*!< SCB INTR_RX_MASK: UNDERFLOW (Bitfield-Mask: 0x01)         */
#define SCB_INTR_RX_MASK_BLOCKED_Pos      (7UL)                 /*!< SCB INTR_RX_MASK: BLOCKED (Bit 7)                         */
#define SCB_INTR_RX_MASK_BLOCKED_Msk      (0x80UL)              /*!< SCB INTR_RX_MASK: BLOCKED (Bitfield-Mask: 0x01)           */
#define SCB_INTR_RX_MASK_FRAME_ERROR_Pos  (8UL)                 /*!< SCB INTR_RX_MASK: FRAME_ERROR (Bit 8)                     */
#define SCB_INTR_RX_MASK_FRAME_ERROR_Msk  (0x100UL)             /*!< SCB INTR_RX_MASK: FRAME_ERROR (Bitfield-Mask: 0x01)       */
#define SCB_INTR_RX_MASK_PARITY_ERROR_Pos (9UL)                 /*!< SCB INTR_RX_MASK: PARITY_ERROR (Bit 9)                    */
#define SCB_INTR_RX_MASK_PARITY_ERROR_Msk (0x200UL)             /*!< SCB INTR_RX_MASK: PARITY_ERROR (Bitfield-Mask: 0x01)      */
#define SCB_INTR_RX_MASK_BAUD_DETECT_Pos  (10UL)                /*!< SCB INTR_RX_MASK: BAUD_DETECT (Bit 10)                    */
#define SCB_INTR_RX_MASK_BAUD_DETECT_Msk  (0x400UL)             /*!< SCB INTR_RX_MASK: BAUD_DETECT (Bitfield-Mask: 0x01)       */
#define SCB_INTR_RX_MASK_BREAK_DETECT_Pos (11UL)                /*!< SCB INTR_RX_MASK: BREAK_DETECT (Bit 11)                   */
#define SCB_INTR_RX_MASK_BREAK_DETECT_Msk (0x800UL)             /*!< SCB INTR_RX_MASK: BREAK_DETECT (Bitfield-Mask: 0x01)      */
/* ==================================================  SCB.INTR_RX_MASKED  =================================================== */
#define SCB_INTR_RX_MASKED_TRIGGER_Pos    (0UL)                 /*!< SCB INTR_RX_MASKED: TRIGGER (Bit 0)                       */
#define SCB_INTR_RX_MASKED_TRIGGER_Msk    (0x1UL)               /*!< SCB INTR_RX_MASKED: TRIGGER (Bitfield-Mask: 0x01)         */
#define SCB_INTR_RX_MASKED_NOT_EMPTY_Pos  (2UL)                 /*!< SCB INTR_RX_MASKED: NOT_EMPTY (Bit 2)                     */
#define SCB_INTR_RX_MASKED_NOT_EMPTY_Msk  (0x4UL)               /*!< SCB INTR_RX_MASKED: NOT_EMPTY (Bitfield-Mask: 0x01)       */
#define SCB_INTR_RX_MASKED_FULL_Pos       (3UL)                 /*!< SCB INTR_RX_MASKED: FULL (Bit 3)                          */
#define SCB_INTR_RX_MASKED_FULL_Msk       (0x8UL)               /*!< SCB INTR_RX_MASKED: FULL (Bitfield-Mask: 0x01)            */
#define SCB_INTR_RX_MASKED_OVERFLOW_Pos   (5UL)                 /*!< SCB INTR_RX_MASKED: OVERFLOW (Bit 5)                      */
#define SCB_INTR_RX_MASKED_OVERFLOW_Msk   (0x20UL)              /*!< SCB INTR_RX_MASKED: OVERFLOW (Bitfield-Mask: 0x01)        */
#define SCB_INTR_RX_MASKED_UNDERFLOW_Pos  (6UL)                 /*!< SCB INTR_RX_MASKED: UNDERFLOW (Bit 6)                     */
#define SCB_INTR_RX_MASKED_UNDERFLOW_Msk  (0x40UL)              /*!< SCB INTR_RX_MASKED: UNDERFLOW (Bitfield-Mask: 0x01)       */
#define SCB_INTR_RX_MASKED_BLOCKED_Pos    (7UL)                 /*!< SCB INTR_RX_MASKED: BLOCKED (Bit 7)                       */
#define SCB_INTR_RX_MASKED_BLOCKED_Msk    (0x80UL)              /*!< SCB INTR_RX_MASKED: BLOCKED (Bitfield-Mask: 0x01)         */
#define SCB_INTR_RX_MASKED_FRAME_ERROR_Pos (8UL)                /*!< SCB INTR_RX_MASKED: FRAME_ERROR (Bit 8)                   */
#define SCB_INTR_RX_MASKED_FRAME_ERROR_Msk (0x100UL)            /*!< SCB INTR_RX_MASKED: FRAME_ERROR (Bitfield-Mask: 0x01)     */
#define SCB_INTR_RX_MASKED_PARITY_ERROR_Pos (9UL)               /*!< SCB INTR_RX_MASKED: PARITY_ERROR (Bit 9)                  */
#define SCB_INTR_RX_MASKED_PARITY_ERROR_Msk (0x200UL)           /*!< SCB INTR_RX_MASKED: PARITY_ERROR (Bitfield-Mask: 0x01)    */
#define SCB_INTR_RX_MASKED_BAUD_DETECT_Pos (10UL)               /*!< SCB INTR_RX_MASKED: BAUD_DETECT (Bit 10)                  */
#define SCB_INTR_RX_MASKED_BAUD_DETECT_Msk (0x400UL)            /*!< SCB INTR_RX_MASKED: BAUD_DETECT (Bitfield-Mask: 0x01)     */
#define SCB_INTR_RX_MASKED_BREAK_DETECT_Pos (11UL)              /*!< SCB INTR_RX_MASKED: BREAK_DETECT (Bit 11)                 */
#define SCB_INTR_RX_MASKED_BREAK_DETECT_Msk (0x800UL)           /*!< SCB INTR_RX_MASKED: BREAK_DETECT (Bitfield-Mask: 0x01)    */


#endif /* _CYIP_SCB_H_ */


/* [] END OF FILE */
